[
  {
    "text": "Happy first day of spring",
    "timestamp": "2022-03-20T13:00:03.000Z"
  },
  {
    "text": "On this day in 1863, Edvard Munch—the man behind The Scream—was born.",
    "timestamp": "2021-12-12T17:00:05.000Z"
  },
  {
    "text": "Comfy Sunday with David Hockney",
    "timestamp": "2022-01-02T17:00:03.000Z"
  },
  {
    "text": "On this day, a legend was born. Happy birthday, Jean-Michel #Basquiat .",
    "timestamp": "2021-12-22T14:00:06.000Z"
  },
  {
    "text": "Happy birthday, David Hockney! ​\nIrises, 1973 | David Hockney",
    "timestamp": "2022-07-09T13:00:02.000Z"
  },
  {
    "text": "Straight from the Artspace moodboard",
    "timestamp": "2021-12-30T17:00:02.000Z"
  },
  {
    "text": "Happy birthday to the one-and-only @jeffkoons",
    "timestamp": "2022-01-21T22:00:02.000Z"
  },
  {
    "text": "Museums and nature – what a better way to start off the weekend",
    "timestamp": "2022-03-18T16:00:02.000Z"
  },
  {
    "text": "#tbt to the 'Francis Bacon: Man and Beast' exhibit at @Tate where the line between human and animal blurred. Stay tuned for upcoming exhibition coverage at Tate this summer.",
    "timestamp": "2022-04-28T16:00:03.000Z"
  },
  {
    "text": "kenyan woman’s startup recycles plastic into bricks that are stronger than concrete https:// designboom.com/technology/gje nge-makers-recycled-plastic-bricks-kenya-02-08-2021/ …",
    "timestamp": "2021-02-08T10:55:03.000Z"
  },
  {
    "text": "hayri atak proposes the striking, sinuous 'sarcostyle tower' for the new york skyline https:// designboom.com/architecture/h ayri-atak-sinuous-sarcostyle-tower-new-york-skyline-01-20-2021/ …",
    "timestamp": "2021-01-20T18:31:36.000Z"
  },
  {
    "text": "lacoste changes its logo in aid of 10 endangered species https:// designboom.com/design/lacoste -save-our-species-changes-logo-endagered-03-02-2018/ …",
    "timestamp": "2018-03-02T11:54:32.000Z"
  },
  {
    "text": "this home-office by ogawa architect design in japan evokes the 'entrance to a small valley' https:// designboom.com/architecture/o gawa-architect-design-vale-atelier-residence-japan-06-12-2023/ …",
    "timestamp": "2023-06-12T10:55:02.000Z"
  },
  {
    "text": "vincent van gogh’s starry night is being turned into a 1,552-piece LEGO set https:// designboom.com/design/vincent -van-gogh-starry-sky-lego-set-truman-cheng-02-14-2021/ …",
    "timestamp": "2021-02-14T18:35:02.000Z"
  },
  {
    "text": "empty food can becomes portal to cozy, miniature reading room https:// designboom.com/art/mozu-studi os-book-can-miniature-room-04-21-2022/ …",
    "timestamp": "2022-04-21T14:20:03.000Z"
  },
  {
    "text": ". @isernserra frames an artist's loft with circular portals in barcelona. https:// designboom.com/architecture/i sern-serra-gallery-house-pol-sola-barcelona-spain-06-21-2023/ …",
    "timestamp": "2023-06-21T06:50:03.000Z"
  },
  {
    "text": "salman khoshroo sculpts 3-dimensional portraits from wool that appear as brush strokes https:// designboom.com/art/salman-kho shroo-3-dimensional-portraits-wool-03-25-2021/ …",
    "timestamp": "2021-03-25T20:26:03.000Z"
  },
  {
    "text": "the vessel in new york may be permanently closed after fourth suicide https:// designboom.com/art/the-vessel -new-york-closed-after-fourth-suicide-08-02-2021/ …",
    "timestamp": "2021-08-02T13:05:16.000Z"
  },
  {
    "text": "estudio estudio revives a 1930s-era house in mexico city with minimalist details. https:// designboom.com/architecture/e studio-estudio-y27-house-mexico-city-06-14-2023/ …",
    "timestamp": "2023-06-14T06:50:03.000Z"
  },
  {
    "text": "midjourney reinvents ancient ziggurat pyramid as modern arts venue https:// designboom.com/architecture/m idjourney-ancient-ziggurat-pyramid-temple-modern-arts-venue-rolando-cedeno-de-la-cruz-04-27-2023/ …",
    "timestamp": "2023-04-27T09:33:15.000Z"
  },
  {
    "text": "motoi yamamoto's intricate salt artworks shape 'a memory of life' — read our interview https:// designboom.com/art/motoi-yama moto-interview-memories-intricate-salt-arrangements-04-07-2021/ …",
    "timestamp": "2021-04-07T10:15:06.000Z"
  },
  {
    "text": "This just in! We’re thrilled to share more details about our upcoming Art Basel Miami Beach show in December. https:// bit.ly/47QlxTx",
    "timestamp": "2024-10-01T13:15:09.000Z"
  },
  {
    "text": "Joining us for Art Basel Miami Beach? Be sure to check out accommodation from @airbnb when planning your stay! From homes with poolside cabanas to penthouses with beach and waterfront views, Airbnb offers a diverse range of properties. Visit http:// airbnb.com/artbaselmb2024",
    "timestamp": "2024-11-15T15:00:37.000Z"
  },
  {
    "text": "Discover everything art can be at #ArtBaselMiamiBeach 2024.\n\nGet your tickets online before they sell out: https:// bit.ly/48RtnN5",
    "timestamp": "2024-11-15T13:57:16.000Z"
  },
  {
    "text": "Delve into the world of painter Stanley Whitney during a visit to his studio, set amid pines on Long Island, New York.",
    "timestamp": "2024-11-14T16:31:16.000Z"
  },
  {
    "text": "Watch the full episode:",
    "timestamp": "2024-11-14T20:47:21.000Z"
  },
  {
    "text": "#ArtBaselMiamiBeach : Data, Surrealism, and a little magic: Gallerist Wendi Norris' recipe for success. \n\nCredited with fostering the legacies of artists such as Leonora Carrington and Dorothea Tanning, she will soon showcase her vibrant program at Art Basel Miami Beach for the",
    "timestamp": "2024-11-14T17:00:42.000Z"
  },
  {
    "text": "#ArtBaselStories : How I became an artist, Sarah Meyohas. \n\nThe New Yorker discusses going from business school to Bitchcoin – and now pastels. Read full story: http:// bit.ly/48MvNMQ",
    "timestamp": "2024-11-14T12:00:15.000Z"
  },
  {
    "text": "#ArtBaselStories : Is the impact of the Great Wealth Transfer being felt by the art market?\n\nWe look at the scale, pace, and shape of shifts in art collecting to date.\n\nLearn more: http:// bit.ly/3Cpmjv7",
    "timestamp": "2024-11-14T07:00:11.000Z"
  },
  {
    "text": "#ModernPatrons : Refik Anadol. \n\nDiscover how the leading new media artist leverages the power of Web3 technologies to support and uplift the Amazon’s Yawanawá tribe: http:// bit.ly/3O79t7d",
    "timestamp": "2024-11-13T15:30:11.000Z"
  },
  {
    "text": "#ArtBaselStories : How Mégane Brauer fights invisibilization with rhinestones and spaghetti. \n\nIn her first museum solo show, the young French artist tells stories of everyday precariousness through politically-charged assemblages: http:// bit.ly/3YEps1q",
    "timestamp": "2024-11-13T10:55:05.000Z"
  },
  {
    "text": "With bold sculptures, vibrant murals, and The Underline park reshaping the landscape, Brickell is becoming a creative hotspot as a younger generation makes the district its home. Leading this transformation is 888 Brickell, developed with @JDSDevelopment with sales represented",
    "timestamp": "2024-11-12T20:30:11.000Z"
  },
  {
    "text": "#ArtBaselMiamiBeach : From Guatemala to Panama, discover Central America through the eyes of art world insiders: http:// bit.ly/3AtAmPE",
    "timestamp": "2024-11-12T12:00:17.000Z"
  },
  {
    "text": "How to Construct a K-Pop Thrill https:// hyperallergic.com/466597/how-to- construct-a-k-pop-thrill/ …",
    "timestamp": "2018-10-21T17:00:01.000Z"
  },
  {
    "text": "Hong Kong protesters are remixing the Christmas card tradition under the #freehkxmascard hashtag and decorating cards with memes and slogans from the ongoing movement.",
    "timestamp": "2019-12-17T22:33:40.000Z"
  },
  {
    "text": "From protests in Hong Kong and Chile to the fires in Australia and California, see a selection of the images nominated for the prestigious photojournalism award.",
    "timestamp": "2020-03-10T23:21:14.000Z"
  },
  {
    "text": "The festival's program is especially robust this year, featuring films about the Hong Kong protests, abortion helpline volunteers, and more.",
    "timestamp": "2020-01-24T04:21:38.000Z"
  },
  {
    "text": "The K-pop idol group creates an open, interpretative framework for the back-and-forth exchanges of visual content and meanings between @BTS_bighit and its fandom, called ARMY. https:// buff.ly/3qXApsf",
    "timestamp": "2021-01-26T22:20:01.000Z"
  },
  {
    "text": "BTS, described as the “biggest boy band in the world,” announced an international public art project with 22 contemporary artists across five cities.",
    "timestamp": "2020-01-22T17:18:10.000Z"
  },
  {
    "text": "Sculptures of vibrant, Oaxacan alejibres tower over NYC’s Rockefeller Center ahead of Día de Los Muertos. https:// buff.ly/3C2m4Rr",
    "timestamp": "2021-10-22T22:58:03.000Z"
  },
  {
    "text": "Family wealth is a key factor in the likelihood of uptaking and sustaining an artistic profession.",
    "timestamp": "2019-04-28T22:00:00.000Z"
  },
  {
    "text": "SO NY STATE IS MAKING MUSEUMS LABEL ALL NAZI-LOOTED ART ON VIEW BUT THEY SHOULD ALSO LABEL ALL ART LOOTED THROUGH GENOCIDE AND COLONIZATION AND EXPAND HOW THE WORKS ENDED UP IN THE COLLECTION IN THE FIRST PLACE ACTUALLY THEY SHOULD RESTITU-",
    "timestamp": "2022-08-18T20:12:23.000Z"
  },
  {
    "text": "\"Break the Silence\", the new concert film about @BTS_twt , demonstrates the vulnerability that makes them so beloved by fans.",
    "timestamp": "2020-10-01T19:50:02.000Z"
  },
  {
    "text": "NYC Mayor Eric Adams slashes school funding by over $200 million, jeopardizing art departments across the city.",
    "timestamp": "2022-07-05T22:45:02.000Z"
  },
  {
    "text": "The National Portrait Gallery announced its seven 2022 Portrait of a Nation awardees, including Anthony Fauci and Ava DuVernay.",
    "timestamp": "2022-01-27T17:57:01.000Z"
  },
  {
    "text": "Even on Taylor Swift's most dramatic songs there’s an underlying calm to Lover, a sense of gratitude and relief at having made it this far.",
    "timestamp": "2019-11-30T23:18:41.000Z"
  },
  {
    "text": "Now Open… Elizabeth Catlett: A Black Revolutionary Artist and All That It Implies!\n\nExplore the career of sculptor and printmaker, devout feminist, and lifelong social justice advocate, Elizabeth Catlett. \n\nGenerous support is provided by @ChristiesInc",
    "timestamp": "2024-09-13T18:58:18.000Z"
  },
  {
    "text": "Did somebody say #museumsnowballfight ? Here's a playful snow scene by 19th-century Japanese artist Utagawa Kunisada: http:// bit.ly/2qn3brU",
    "timestamp": "2018-01-04T18:13:12.000Z"
  },
  {
    "text": "David Bowie is… making its final stop @brooklynmuseum ! Select tickets go on presale today: http:// bit.ly/davidbowieisbkm #davidbowieisbkm",
    "timestamp": "2017-10-04T15:01:10.000Z"
  },
  {
    "text": "“Down in the underground, a land serene.” #DavidBowieis going underground… to ride the subway. Station to station, borough to borough, it’s the real New York way to experience #bowiecity . http:// bit.ly/2Iryl6t #DavidBowieisBKM",
    "timestamp": "2018-03-24T17:00:01.000Z"
  },
  {
    "text": "David Bowie is has officially hit 2,000,000 visitors! As the final stop of its global tour, we are thrilled to be part of this milestone day and to name Nicole as the lucky visitor! This Bowie fan will be traveling home to Dublin with a suitcase full of swag. Congrats Nicole!",
    "timestamp": "2018-06-20T19:38:02.000Z"
  },
  {
    "text": "#Your2020Portrait | To celebrate the Class of 2020, we’re teaming up with @Instagram to host an online portrait exhibition. We’re asking graduates to create portraits to help them mark this moment. Head to https:// bit.ly/SubmitYour2020 Portrait … to learn more and submit your work by May 5.",
    "timestamp": "2020-05-01T21:00:07.000Z"
  },
  {
    "text": "Paul Cézanne makes daydreaming easy with \"The Village of Gardanne.\"\n⁠\nIn an 1886 letter he wrote, “The sky, the boundless things of nature, continue to attract me and provide me with the opportunity to look with pleasure.”\n⁠ Paul Cézanne (French, 1839–1906)",
    "timestamp": "2022-03-04T15:00:07.000Z"
  },
  {
    "text": "Ground Control to Major Tom—We are now completely SOLD OUT of ALL the remaining tickets for David Bowie is. Thank you for making the final bow of this amazing exhibition a huge success! http:// bit.ly/2IOZPSw",
    "timestamp": "2018-07-15T15:52:47.000Z"
  },
  {
    "text": "The wait is officially over! We’re so excited to welcome #davidbowieisbkm ticketholders to enjoy a complete audiovisual experience into Bowie’s personal archive through more than 500 objects from across his five-decade long career. http:// bit.ly/bowiebkm",
    "timestamp": "2018-03-02T17:43:13.000Z"
  },
  {
    "text": "In Artforum’s November issue: Pablo Larios interviews Lee Ufan, Gordon Hughes on Benjamin Buchloh and Hal Foster’s Exit Interview, Natasha Degen on the rise of artists’ agents, Percy Zvomuya on two Swiss shows challenging the colonial narrative, and more.",
    "timestamp": "2024-11-01T18:14:03.000Z"
  },
  {
    "text": "Waters, an ardent champion of his hometown, bequeathed 375 artworks and objects from his collection to the museum, receivable upon his death, with the stipulation that the museum name its east lobby bathrooms after him.",
    "timestamp": "2021-08-04T23:08:10.000Z"
  },
  {
    "text": "“The possessive investment in whiteness can’t be rectified by learning ‘how to be more antiracist.’ It requires a radical divestment in the project of whiteness and a redistribution of wealth and resources. It requires abolition.” \n\n—Saidiya Hartman https:// bit.ly/2CBYhhb",
    "timestamp": "2020-07-14T15:35:24.000Z"
  },
  {
    "text": "No Text Found",
    "timestamp": "2018-11-30T17:23:19.000Z"
  },
  {
    "text": "Musician-artist Björk talks with author-scientist Robin Wall Kimmerer about how language connects us to the natural world and what it means to live in relationship to the land in the latest episode of Artists on Writers | Writers on Artists.",
    "timestamp": "2022-10-27T15:12:29.000Z"
  },
  {
    "text": "To ring in the new year, we have unlocked our paywall for the next 48 hours.\n\nAll online content—including the new Jan/Feb issue and our entire archive (spanning nearly six decades)—is currently free for readers. Simply visit http:// artforum.com .",
    "timestamp": "2021-01-01T16:02:43.000Z"
  },
  {
    "text": "Lawrence Weiner, a central figure of Conceptualism who profoundly altered the landscape of American art, has died at 79. “It was not ironic,” he said of his work. “It was not against anything except the entire culture. That’s what art is.”",
    "timestamp": "2021-12-02T20:56:03.000Z"
  },
  {
    "text": "Breaking: Nan Goldin arrested outside @NYGovCuomo ’s office during protest demanding the creation of promised overdose prevention centers",
    "timestamp": "2019-08-28T16:20:37.000Z"
  },
  {
    "text": "“Thirty-three years after she died in a fall from Carl Andre’s balcony, Ana Mendieta’s ghostly silhouettes are powerful, painful reminders of her untimely erasure.” Catherine Wood's 2018 Top Ten https:// bit.ly/2RdEwT6",
    "timestamp": "2018-12-28T18:01:06.000Z"
  },
  {
    "text": "“Grounding movement—and the mediation of memory—fully in the authorial body, Mitchell discovers her true subject.”\n\nMolly Warnock on the art of Joan Mitchell: http:// bit.ly/3qNPvQY",
    "timestamp": "2021-03-23T21:45:05.000Z"
  },
  {
    "text": "The Pratone lounge chair, designed for Gufram in 1971, resembles a patch of grass among which we can sink and lie. The polyurethane lounge chair creates an unconventional seating situation that challenges traditional design values. © Gufram / Kent Pell",
    "timestamp": "2023-01-07T17:00:09.000Z"
  },
  {
    "text": "To mark the final day of #halfterm , tomorrow's #fontsunday is dedicated to children's TV shows.  Send in your fondest memories from noon.",
    "timestamp": "2020-02-23T11:00:20.000Z"
  },
  {
    "text": "Remember these? Today's #fontsunday is #backtoschool fonts. From library and report cards to textbooks and uniforms, send in your favourite memories from noon.",
    "timestamp": "2018-09-09T10:00:27.000Z"
  },
  {
    "text": "To mark #InternationalWomensDay2020 , today's #fontsunday will explore books written by women. Send in your favourites from noon.",
    "timestamp": "2020-03-08T11:00:35.000Z"
  },
  {
    "text": "This is the Bialetti Moka Express – it came out in 1933 and revolutionised the way of making coffee at home. The octagonal and aluminium Art Deco design has remained the same since its introduction. Do you own a Bialetti?",
    "timestamp": "2023-02-19T10:00:31.000Z"
  },
  {
    "text": "#DesignOfTheWeek | A look at 1980's Hispanic @Barbie ​\n​\nIn 1980, Barbie launched the first Hispanic doll and also the first Black and Asian dolls - an important step towards representation.​\n​\nSee this doll IRL as part of #BarbieTheExhibition , on until February 2025. Tap the",
    "timestamp": "2024-07-29T10:49:23.000Z"
  },
  {
    "text": "Today's theme is a #fontsunday classic! | The topic is fonts on #bookspines . Send in your favourites from noon.",
    "timestamp": "2020-01-26T11:00:02.000Z"
  },
  {
    "text": "Today means a lie-in followed by a good breakfast. | The theme for #fontsunday is cereal boxes. Send in your favourites from noon. \n\nWho's your preferred breakfast host, Barbie or Cabbage Patch Kids?",
    "timestamp": "2020-02-09T11:00:16.000Z"
  },
  {
    "text": "Today's #FontSunday will be all about scribbles.  Send in your favourites from noon | Will you be taking part?",
    "timestamp": "2019-11-17T11:00:06.000Z"
  },
  {
    "text": "In honour of the postman still going strong and delivering our post during the outbreak, today's #fontsunday is dedicated to them. From packages, uniforms, letterboxes, stamps to letters - send in your favourite examples from noon.",
    "timestamp": "2020-05-10T10:00:34.000Z"
  },
  {
    "text": "Happy birthday to British typographer & graphic designer Margaret Calvert ⁣\n\nCalvert’s work in transforming the UK’s road signage system, to the wayfinding at railway stations & airports, has been central in shaping much of our national visual identity.",
    "timestamp": "2023-05-12T09:00:32.000Z"
  },
  {
    "text": "#AuctionUpdate Monkey Business : #Banksy ’s monumental painting of the House of Commons overrun with parliamentary primates sells to applause at £9,879,500 - 9 times its previous record - after a 13 minute bidding battle.",
    "timestamp": "2019-10-03T19:06:32.000Z"
  },
  {
    "text": "It's official. For the first time in our 277-year history, apes and kennels are storming Sotheby’s. The @BoredApeYC sale starts September 2. Ape In.",
    "timestamp": "2021-08-28T14:00:25.000Z"
  },
  {
    "text": "#Breaking #TOP , Asian pop icon&collector,will guest-curate special sale #TTTOP in #HongKong http:// bit.ly/29Qw5Vj",
    "timestamp": "2016-07-25T03:23:21.000Z"
  },
  {
    "text": "Behind the scenes with Asian pop icon #TOP ! Details in mid Aug. Photo by Kevin Ching, CEO of #SothebysAsia #TTTOP",
    "timestamp": "2016-08-09T08:00:40.000Z"
  },
  {
    "text": "Bored Ape Yacht Club and Bored Ape Kennel Club have paved the way for what NFT art communities can be. Whether it’s your online identity, a shared culture, or you just want to ape in...the @BoredApeYC sale starts September 2. Details here: https:// bit.ly/3t08Scf",
    "timestamp": "2021-08-30T16:00:43.000Z"
  },
  {
    "text": "#AuctionUpdate George Condo's 'Female Portrait Composition' fetches $972.5K quickly followed by 'Big John' for $948.5K #TriumphofPainting",
    "timestamp": "2016-11-18T19:52:27.000Z"
  },
  {
    "text": "#AuctionUpdate : ‘Juin-Octobre 1985’, the largest work by Franco-Chinese artist Zao Wou-Ki, sold for HK$510m / US$65m: world auction record for Zao Wou-Ki, world auction record for an oil painting by an Asian artist, most valuable painting sold by any auction house in #HongKong",
    "timestamp": "2018-09-30T09:32:39.000Z"
  },
  {
    "text": "New details announced for #TTTOP x #Sothebys ! Read more at: http:// sothebys.com/tttop #sothebyscontemporary",
    "timestamp": "2016-08-22T04:01:46.000Z"
  },
  {
    "text": "#AuctionUpdate 101 Bored Ape Yacht Club NFTs just sold for $24.4 million and 101 Bored Ape Kennel Club NFTs achieved $1.8 million in our Ape in! auction - the most significant #BAYC sale to date. Congrats to all the apes out there",
    "timestamp": "2021-09-09T14:18:22.000Z"
  },
  {
    "text": "Moments ago in our #London saleroom, an extremely rare “Alien” CryptoPunk #7523 from the collection of @sillytuna sold for $11.8M as part of our #NativelyDigital NFT auction – setting a new world auction record for a single CryptoPunk.",
    "timestamp": "2021-06-10T14:28:22.000Z"
  },
  {
    "text": "Who did this...\n\nYet another amateur art restorer in Spain has absolutely demolished a once-beautiful artwork: https:// bit.ly/3lnlc1p",
    "timestamp": "2020-11-11T16:24:02.000Z"
  },
  {
    "text": "New in NYC: A cube made from $11.7 million worth of solid gold is sitting in Central Park—and has its own security detail: https:// bit.ly/32So5U1",
    "timestamp": "2022-02-02T18:39:08.000Z"
  },
  {
    "text": "Spain has been hit by yet another bungling restorer, who turned this Virgin Mary painting into an unrecognizable blob: https:// bit.ly/2YrtKeO",
    "timestamp": "2020-06-23T01:45:03.000Z"
  },
  {
    "text": "Introducing the 2022 Artnet Innovators List: 35 game-changers, dreamers, and mavericks transforming the art industry: https:// bit.ly/3VjHbbn",
    "timestamp": "2022-11-30T21:00:19.000Z"
  },
  {
    "text": "The internet killed the yellow pages. Netflix killed Blockbuster.\n\nWill NFTs kill traditional art?\n\nGreetings, my name is @CozomoMedici . What I'm about to share with you may make you angry. You may disagree. But it's crucial you here it. \n\nSo buckle up, and let's begin",
    "timestamp": "2021-12-15T21:21:51.000Z"
  },
  {
    "text": "Italy can evict Steve Bannon's school for far-right 'gladiators' from an 800-year-old monastery, the country's top court rules: https:// bit.ly/2P8ZDH4",
    "timestamp": "2021-03-27T22:20:07.000Z"
  },
  {
    "text": "How K-pop star and budding mega-collector RM wove his favorite art and artists into his first solo album, \"Indigo\": https:// bit.ly/3VW40BY",
    "timestamp": "2022-12-08T16:30:15.000Z"
  },
  {
    "text": "Any new #NFTs we should be aware of?",
    "timestamp": "2022-01-05T15:45:40.000Z"
  },
  {
    "text": "What does K-Pop star RM collect? Here are 8 artists the burgeoning celebrity patron has snapped up: https:// bit.ly/3pYbWoy",
    "timestamp": "2022-08-30T19:30:08.000Z"
  },
  {
    "text": "John Waters has pledged to donate his art collection to the Baltimore Museum once he dies—so long as it names its bathrooms after him: https:// bit.ly/38Hlv3P",
    "timestamp": "2020-11-12T19:15:07.000Z"
  },
  {
    "text": "The Actor Who Played Robocop Is Now an Art Historian, and He’s Returning to Detroit With a New Mission: Renaissance Art https:// artnt.cm/2nEBbfq",
    "timestamp": "2018-08-14T23:03:03.000Z"
  },
  {
    "text": "1/ I am here to let you know that, over the next decade, art might actually save the world.\n\nOur world is becoming progressively digital.   It is critically important that this world, the coming metaverse, is open and free and interoperable.\n\nAnd art might get us there.",
    "timestamp": "2021-12-19T20:52:50.000Z"
  }
]