[
  {
    "text": "Midlife, not your 70s or 80s, is when brain changes start to occur that can pave the way toward dementia, according to a growing body of research. Intervening earlier to improve brain health might help you stay sharper as you age. https:// on.wsj.com/3Z1MsZv",
    "timestamp": "2024-11-16T11:06:05.000Z"
  },
  {
    "text": "Three hours on Costco. Seven hours on Nvidia. Nine hours on Berkshire Hathaway. Why listeners can’t get enough of this podcast.",
    "timestamp": "2024-11-16T10:49:58.000Z"
  },
  {
    "text": "Take a look at the front page of today's Wall Street Journal. https:// on.wsj.com/4eDODHk",
    "timestamp": "2024-11-16T10:30:09.000Z"
  },
  {
    "text": "Moving into a 14,000-square-foot château was a dream come true for this American family. But when they arrived, reality set in.",
    "timestamp": "2024-11-16T10:05:29.000Z"
  },
  {
    "text": "Friedrich Merz waited years for his chance to lead Germany—but a win would saddle him with the daunting task of rebuilding the economy",
    "timestamp": "2024-11-16T09:49:15.000Z"
  },
  {
    "text": "Mismatched socks are bad, ankle socks dated—and don’t get our writer started on “no-show” styles. Our definitive guide to the rules that apply to men’s socks.",
    "timestamp": "2024-11-16T09:31:42.000Z"
  },
  {
    "text": "There’s no need to stick with chemically coated \"nonstick\" pans. For happier and healthier cooking, there’s a tried-and-true method to keep food from clinging.",
    "timestamp": "2024-11-16T09:11:23.000Z"
  },
  {
    "text": "There’s never a great time to infuriate your most loyal customers. For Sonos, the timing couldn’t have been worse.",
    "timestamp": "2024-11-16T08:52:09.000Z"
  },
  {
    "text": "Elon Musk and Vivek Ramaswamy’s new government-efficiency department is soliciting applications on X. You need to subscribe to the social-media platform to apply.",
    "timestamp": "2024-11-16T08:35:00.000Z"
  },
  {
    "text": "Elon Musk has become the “most influential” member of President-elect Donald Trump’s orbit after spending $200 million to help get him elected. Inside Musk's role on the Trump transition team.",
    "timestamp": "2024-11-16T08:17:53.000Z"
  },
  {
    "text": "In a remarkable feat of nature, two injured sea creatures merged into a single animal by fusing their nervous and digestive systems",
    "timestamp": "2024-11-16T07:56:32.000Z"
  },
  {
    "text": "Vivek Ramaswamy is about to do something that doesn’t come naturally for him: live under the shadow of someone even richer and more beloved by the Republican base than he is",
    "timestamp": "2024-11-16T07:38:57.000Z"
  },
  {
    "text": "Critics accuse Donald Trump of being too chaotic to get much done. The speed of his first appointments should disabuse them. The next administration means business https:// econ.st/3UTv4DT",
    "timestamp": "2024-11-14T16:00:27.000Z"
  },
  {
    "text": "The world of imagined pasts is rich and potentially endless, as our selection of alternate-history novels demonstrates. Discover the best ones here: https:// econ.st/3Ow2Snb",
    "timestamp": "2024-11-16T11:02:18.000Z"
  },
  {
    "text": "Hamas is abandoned by its allies, resented by Gazans and still under attack from Israel. Soon, it may also lose its comfortable outpost in the capital of Qatar https:// econ.st/3Cnfl9F",
    "timestamp": "2024-11-16T10:46:50.000Z"
  },
  {
    "text": "Almost a decade after Ed Miliband led Britain’s Labour Party to a humiliating defeat, he is back in government and hoping to win support for clean power. He may not achieve his targets. But he does know how to frame political fights https:// econ.st/4eB3tye",
    "timestamp": "2024-11-16T10:31:09.000Z"
  },
  {
    "text": "Muhammad Yunus, a microfinance pioneer and Nobel peace laureate, has restored order as Bangladesh’s interim leader—for now. \n\nThe country’s caretaker faces important tasks ahead, starting with setting a date for elections https:// econ.st/3O7s2rN",
    "timestamp": "2024-11-16T10:25:55.000Z"
  },
  {
    "text": "Have you been following the headlines this week? Test your news knowledge with our weekly pint-sized news quiz https:// econ.st/3USOV6c",
    "timestamp": "2024-11-16T10:08:04.000Z"
  },
  {
    "text": "During his campaign Donald Trump promised another tax bonanza, albeit in vague terms. A maximalist interpretation of his various campaign promises implies a big boost to corporate America’s profits. But every tax bill has its losers https:// econ.st/3ObxEBt",
    "timestamp": "2024-11-16T09:51:01.000Z"
  },
  {
    "text": "A bill that could ban political parties and sitting MPs from receiving donations or gifts has been introduced by South Australia’s government this week. But while it has wide support in the state’s parliament, it is likely to face challenges https:// econ.st/3Cxtr8D",
    "timestamp": "2024-11-16T09:35:06.000Z"
  },
  {
    "text": "Too much loyalty can harm workers who risk being given extra work for little extra reward. After all, dogs are known for their loyalty but not for their brains https:// econ.st/3UTW6uG",
    "timestamp": "2024-11-16T09:22:52.000Z"
  },
  {
    "text": "There is a growing recognition that government regulation matters in a world worried about climate. The boss of ExxonMobil, America’s biggest oil-and-gas company, advocated for such an intervention at the UN’s annual climate summit this week https:// econ.st/3OaMckL",
    "timestamp": "2024-11-16T09:05:11.000Z"
  },
  {
    "text": "Coal is the dirtiest fossil fuel, but it still produces a third of the world’s electricity. Can countries phase it out as an energy source? Find out on “Babbage”",
    "timestamp": "2024-11-16T08:46:20.000Z"
  },
  {
    "text": "Most locals in Kyrgyzstan’s Mailuu-Suu are blasé about the threat of the dams collapsing: they are more worried about making a living than a potential radioactive flood. From 1843 magazine",
    "timestamp": "2024-11-16T08:29:13.000Z"
  },
  {
    "text": "Does dividend investing create bad investor behavior?\n \nOn this week’s episode of Investing Insights, we look at the pros and cons of dividend investing and why this popular income strategy has divided so many investors. http:// spr.ly/6010sTLdg",
    "timestamp": "2024-11-15T16:00:30.000Z"
  },
  {
    "text": "After years of underperformance, can small-cap stocks finally enjoy a durable rally? Here’s how investors should play the under-loved category.",
    "timestamp": "2024-11-16T00:00:00.000Z"
  },
  {
    "text": "If you own mutual funds in a taxable account, you may find yourself with a tax bill despite not having sold a single share.",
    "timestamp": "2024-11-15T22:00:00.000Z"
  },
  {
    "text": "What Donald Trump’s comeback means for Chinese equities, and how China is likely to respond next.",
    "timestamp": "2024-11-15T20:00:00.000Z"
  },
  {
    "text": "Stock markets rallied after Donald Trump’s victory in the US presidential election, pushing $TSLA and dozens of others into overvalued territory.",
    "timestamp": "2024-11-15T18:00:00.000Z"
  },
  {
    "text": "Discover the impact of the 1.1% shortfall in investment returns in this webinar session with Jeff Ptak and Christine Benz. Join the conversation here: http:// spr.ly/6014SPeMq",
    "timestamp": "2024-11-15T15:00:14.000Z"
  },
  {
    "text": "Where does this elusive measure of firm health come from, and how can advisors build momentum behind it?",
    "timestamp": "2024-11-15T14:00:00.000Z"
  },
  {
    "text": "$BAYRY and $PFE are among these 10 undervalued healthcare stocks that offer investors attractive entry points into a defensive sector.",
    "timestamp": "2024-11-15T12:00:01.000Z"
  },
  {
    "text": "A different way to gain access to the corporate debt risk premium.",
    "timestamp": "2024-11-15T00:00:01.000Z"
  },
  {
    "text": "Key takeaways from Berkshire Hathaway's just-released 13F filing from Q3:",
    "timestamp": "2024-11-14T23:36:24.000Z"
  },
  {
    "text": "The clock is ticking on required minimum distributions for this year. Here’s how to avoid costly mistakes with your RMDs.",
    "timestamp": "2024-11-14T22:00:00.000Z"
  },
  {
    "text": "How are things looking for equity investors? Variables are at play, and historic patterns can help decode the future. Savita Subramanian, Head of US Equity and Quantitative Strategy at Bank of America Merrill Lynch, gave her view from the #MICUS stage: http:// spr.ly/6019sJoDv",
    "timestamp": "2024-11-14T20:00:18.000Z"
  },
  {
    "text": "When Sam Bankman-Fried’s crypto empire went down in flames, so did his plans to save the world",
    "timestamp": "2022-11-24T10:32:12.000Z"
  },
  {
    "text": "Investors are turning their attention to newer digital assets such as DigiByte, VeChain and SafeMoon in the hunt for cheaper alternatives https:// wsj.com/articles/dogec oins-12-000-rally-spurs-hunt-for-next-crypto-winner-11620293371?reflink=desktopwebshare_twitter …",
    "timestamp": "2021-05-06T19:55:45.000Z"
  },
  {
    "text": "Federal Reserve officials are considering lending cash directly to hedge funds through clearinghouses to ease stress in the repo market. But that could be a tough sell for policy makers. https:// on.wsj.com/2tg7eZp",
    "timestamp": "2020-01-14T12:20:05.000Z"
  },
  {
    "text": "The Biden administration says its tax enforcement plan—doubling IRS staffing and getting a better look at cryptocurrency transactions—would generate $700 billion over the next decade.",
    "timestamp": "2021-05-20T21:23:05.000Z"
  },
  {
    "text": "Breaking: Citadel CEO Ken Griffin outbid a group of crypto investors for copy of U.S. Constitution",
    "timestamp": "2021-11-19T20:03:23.000Z"
  },
  {
    "text": "Intercontinental Exchange is ready to launch its long-awaited bitcoin-futures market, betting consumers and Wall Street will embrace cryptocurrencies. https:// on.wsj.com/30FCVWL",
    "timestamp": "2019-09-22T16:08:01.000Z"
  },
  {
    "text": "China faces the highest consumer inflation in nearly a decade along with a toxic combination of stagnating growth and soaring prices https:// on.wsj.com/2Q7lDjd",
    "timestamp": "2019-12-29T22:34:05.000Z"
  },
  {
    "text": "La Caixa i el Banc Sabadell cauen en borsa. Primers senyals que mercats reaccionen a la crisi politica de Catalunya",
    "timestamp": "2017-09-20T16:16:20.000Z"
  },
  {
    "text": "Lawmakers next week are likely to force Chinese firms with shares traded on American exchanges to finally comply with audit-oversight rules—or leave U.S. markets altogether https:// on.wsj.com/2KRD4nX",
    "timestamp": "2020-11-28T14:23:01.000Z"
  },
  {
    "text": "The numbers are in—the U.S. economy added 313,000 jobs in February, the strongest monthly gain since July 2016. The unemployment rate held steady at 4.1%: http:// on.wsj.com/2FnEnHF",
    "timestamp": "2018-03-09T13:33:58.000Z"
  },
  {
    "text": "Bank of America has eliminated a free checking account popular with customers with low balances http:// on.wsj.com/2F1X0fp via @RachelEnsignWSJ",
    "timestamp": "2018-01-22T17:40:12.000Z"
  },
  {
    "text": "Check out the latest @WSJ video on crypto today: Cardano’s Ada Wants to Solve Some of Crypto’s Biggest Challenges https:// on.wsj.com/2Y5zcGA",
    "timestamp": "2021-09-28T20:40:59.000Z"
  },
  {
    "text": "Terraform Labs has named an interim CEO to run the crypto company while co-founder Do Kwon faces fraud charges",
    "timestamp": "2023-07-19T11:02:55.000Z"
  },
  {
    "text": "As April 15 tax day nears, here's a question: Where do your tax dollars go? http:// on.wsj.com/1sO8LLQ",
    "timestamp": "2014-04-12T16:12:27.000Z"
  },
  {
    "text": "The housing crisis is past history in the minds of most Americans, but the reality is that some 2.5 million homeowners are still underwater on their mortgages. Until a few months ago, WSJ reporter @RyanDezember was one of them http:// on.wsj.com/2FjxPoZ via @WSJ",
    "timestamp": "2018-01-26T17:25:03.000Z"
  },
  {
    "text": "A $10,000 investment in Google at its $85 IPO price would be worth $139,458.82 today: http:// on.wsj.com/1qmkvRq",
    "timestamp": "2014-08-20T08:23:14.000Z"
  },
  {
    "text": "The blacklisting of Chinese stocks prompts banks to delist hundreds of derivatives",
    "timestamp": "2021-01-11T12:45:06.000Z"
  },
  {
    "text": "Most cars are painted one of these four colors—here's why",
    "timestamp": "2024-11-16T08:00:20.000Z"
  },
  {
    "text": "Here's how much money you should have in your retirement accounts by age 30, 40, 50 and beyond",
    "timestamp": "2024-11-16T07:30:08.000Z"
  },
  {
    "text": "Nearly 22 million Americans are millionaires. Here's how they got wealthy",
    "timestamp": "2024-11-16T07:15:04.000Z"
  },
  {
    "text": "They moved abroad hoping to save money — here’s what they found out",
    "timestamp": "2024-11-16T07:00:16.000Z"
  },
  {
    "text": "5 key things to know when you create a will and make other end-of-life plans",
    "timestamp": "2024-11-16T06:45:05.000Z"
  },
  {
    "text": "Tipping in the United States has gotten out of control, experts say. Here's why",
    "timestamp": "2024-11-16T06:15:05.000Z"
  },
  {
    "text": "Here are 3 money moves wealthy Americans are more likely to make in times of economic uncertainty",
    "timestamp": "2024-11-16T06:00:04.000Z"
  },
  {
    "text": "Workers are secretly using ChatGPT, A.I. and it will pose big risks for tech leaders",
    "timestamp": "2024-11-16T05:45:05.000Z"
  },
  {
    "text": "Why it's so difficult to build nuclear power plants in the U.S.",
    "timestamp": "2024-11-16T05:30:09.000Z"
  },
  {
    "text": "Why Airbus and others are betting on hydrogen-powered planes instead of electric planes",
    "timestamp": "2024-11-16T05:15:04.000Z"
  },
  {
    "text": "Money tips for single moms: 'It can be very challenging to raise kids on one income,' advisor says",
    "timestamp": "2024-11-16T05:00:27.000Z"
  },
  {
    "text": "TikTok interviewers ask ‘How much do you make?’ What you can learn from the answers",
    "timestamp": "2024-11-16T04:45:05.000Z"
  },
  {
    "text": "What it takes to turn an old passenger plane into a cargo hauler",
    "timestamp": "2024-11-16T04:30:05.000Z"
  },
  {
    "text": "Ukraine’s president Volodymyr Zelenskyy is the FT’s person of the year 2022. The 44-year-old has earnt a place in history for his extraordinary display of leadership and fortitude https:// on.ft.com/3HfSq0F",
    "timestamp": "2022-12-05T08:15:09.000Z"
  },
  {
    "text": "Breaking news: The EU has warned Elon Musk that Twitter could be banned in Europe unless the billionaire abides by its strict rules on content moderation https:// on.ft.com/3AX3oUM",
    "timestamp": "2022-11-30T18:01:53.000Z"
  },
  {
    "text": "Breaking news: The White House is pushing for a meeting with the World Anti-Doping Agency to discuss loosening restrictions on the use of cannabis by athletes. Here's why https:// ft.com/content/57a868 35-cfd6-42a1-abfa-2a1a545ed96f …",
    "timestamp": "2021-07-09T18:59:08.000Z"
  },
  {
    "text": "Lula is back: Bolsonaro’s old nemesis returns to haunt him",
    "timestamp": "2021-03-09T00:37:18.000Z"
  },
  {
    "text": "‘Jacob Rees-Mogg you're right. You don't need to visit the border... you need to have lived here.’ \n\nBelfast-born actor Stephen Rea explores the real impact of Brexit and the uncertainty of the future of the Irish border in a short film written by Clare Dwyer Hogg.",
    "timestamp": "2018-09-21T06:30:00.000Z"
  },
  {
    "text": "Edward Luce spoke with dozens of officials to discover what went wrong in Donald Trump’s first real crisis — and found a president who ignored increasingly urgent intelligence warnings and dismissed anyone who claimed to know more than him",
    "timestamp": "2020-05-14T08:00:06.000Z"
  },
  {
    "text": "Donald Trump’s debt totals at least $1.1bn. Should he win re-election, about $900m of it will come due during his second term https:// on.ft.com/3oqPFNT",
    "timestamp": "2020-10-26T08:40:06.000Z"
  },
  {
    "text": "Opinion: At least 1m people in Britain are estimated to have lost their jobs since March. Dominic Cummings is not one of them. That’s all you need to know about this week in British politics",
    "timestamp": "2020-05-29T17:00:06.000Z"
  },
  {
    "text": "Opinion: Argentine President Mauricio Macri has lost touch with reality, and that may have scared markets even more than the prospect of Cristina Fernández de Kirchner’s return.",
    "timestamp": "2019-08-13T18:30:10.000Z"
  },
  {
    "text": "Joe Biden and Donald Trump are neck and neck in the latest poll in Texas. And Democrats are raising record amounts of money there. Here's how they hope to shift the Lone Star state with the help of powerful women: https:// ft.com/content/19e4f6 e5-9684-4341-976d-da59cc1aecb7 …",
    "timestamp": "2020-10-27T14:31:05.000Z"
  },
  {
    "text": "TikTok and WeChat will be removed from all US app stores from Sunday, according to a Trump executive order https:// on.ft.com/2ZQtG8v",
    "timestamp": "2020-09-18T11:42:30.000Z"
  },
  {
    "text": "How F1 Champion Nico Rosberg Scored $100 Million For A New VC Fund http:// on.forbes.com/6010sTZ12",
    "timestamp": "2024-11-15T14:18:09.000Z"
  },
  {
    "text": "How Cisco Infuses Messaging With Corporate Values https:// trib.al/3A1h94l",
    "timestamp": "2024-11-16T11:00:17.000Z"
  },
  {
    "text": "How To Reduce Your Carbon Footprint https:// trib.al/fZjfcS2",
    "timestamp": "2024-11-16T11:00:16.000Z"
  },
  {
    "text": "Brace For Climate Impact https:// trib.al/cNz8zpf",
    "timestamp": "2024-11-16T10:30:13.000Z"
  },
  {
    "text": "This U.S. Company Is Cashing In On Ukraine’s War With Killer Drones That Fit In A Backpack https:// trib.al/aB9ZBiR",
    "timestamp": "2024-11-16T10:00:18.000Z"
  },
  {
    "text": "How Gwyneth Paltrow Broke Business Rules As Goop's CEO https:// trib.al/2oMnaPz",
    "timestamp": "2024-11-16T10:00:18.000Z"
  },
  {
    "text": "With its first casino resort set to open in 2027, a little-known emirate is suddenly an unlikely hot gaming market. Here’s how the U.S. casino giant made a high-stakes bet on its future—and left Abu Dhabi, Dubai and other casino operators in the dust. https:// trib.al/ZQXCx9O",
    "timestamp": "2024-11-16T09:30:10.000Z"
  },
  {
    "text": "This Tech Entrepreneur Is The Richest Black Person In America https:// trib.al/Q4AtoOv",
    "timestamp": "2024-11-16T09:30:08.000Z"
  },
  {
    "text": "This Ex-Shoe Salesman Built A $5.5 Billion Fortune In Aging Apartment Buildings https:// trib.al/7svdYMk",
    "timestamp": "2024-11-16T09:00:15.000Z"
  },
  {
    "text": "Want To Make The Forbes 400 List? Try These 2 Industries https:// trib.al/LgQQfWo",
    "timestamp": "2024-11-16T08:30:07.000Z"
  },
  {
    "text": "Taylor Swift, Magic Johnson, Sam Altman: The American Billionaires Too Poor To Make The 2024 Forbes 400 List https:// trib.al/TF7zKhY",
    "timestamp": "2024-11-16T08:00:10.000Z"
  },
  {
    "text": "How Donald Trump Climbed Back Onto The Forbes 400 https:// trib.al/wvnBAf9",
    "timestamp": "2024-11-16T07:30:09.000Z"
  },
  {
    "text": "Why The Commanders’ Owner Thinks $6 Billion For An NFL Team Is A Bargain https:// trib.al/PbvgG9J",
    "timestamp": "2024-11-16T07:00:14.000Z"
  },
  {
    "text": "Today & every day, we remember the lives lost on 9/11, including our Bloomberg colleagues Peter Craig Alderman, William H. Kelly Jr., & Paul Ortiz Jr. \n\nTheir names, written on the wall of our NYC headquarters, stand as a lasting tribute. #NeverForget : 9/11 Memorial & Museum",
    "timestamp": "2024-09-11T12:00:16.000Z"
  },
  {
    "text": "Rewind to 2004 and the launch of our first keyboard with biometrics! The Centerboard introduced biometric authentication and enhanced multimedia features. Its unique design, inspired by a sailboat’s centerboard, set new standards for keyboards.",
    "timestamp": "2024-08-30T14:00:16.000Z"
  },
  {
    "text": "Our employees shape the future of Bloomberg. Here’s how we're investing in our people.",
    "timestamp": "2024-07-01T12:30:07.000Z"
  },
  {
    "text": "Interested in learning more? Our 2023 Impact Report is out now.",
    "timestamp": "2024-07-01T12:30:07.000Z"
  },
  {
    "text": "Pride all day, every day, everywhere. As Bloomberg offices all over the world celebrate Pride Month, we re-affirm our commitment to building an inclusive workplace and world, while reflecting on the progress made and work still to be done. #Pride",
    "timestamp": "2024-06-28T13:00:04.000Z"
  },
  {
    "text": "As growing inequality threatens economic stability, we’re helping investors, entrepreneurs and policymakers build more sustainable communities. Here’s how",
    "timestamp": "2024-06-17T12:30:06.000Z"
  },
  {
    "text": "Interested in learning more? Our 2023 Impact Report is available now.",
    "timestamp": "2024-06-17T12:30:07.000Z"
  },
  {
    "text": "Step inside Bloomberg’s Mumbai office.",
    "timestamp": "2024-06-13T17:22:26.000Z"
  },
  {
    "text": "Calling all football fanatics (and pressured peers) Join our 2024 UEFA European Football Championship bracket and see how far your instincts can take you. Run BRKT <GO> on the Bloomberg Terminal to find out more.",
    "timestamp": "2024-06-10T10:00:10.000Z"
  },
  {
    "text": "With less than a decade to prevent catastrophic impacts from global warming, we’re reducing Bloomberg’s carbon emissions in line with a 1.5°C future. Here’s how.",
    "timestamp": "2024-05-31T12:30:07.000Z"
  },
  {
    "text": "Jake Paul beats 58-year-old Mike Tyson as the hits don’t match the hype",
    "timestamp": "2024-11-16T10:26:04.000Z"
  },
  {
    "text": "Treasury yields slip ahead of retail sales report",
    "timestamp": "2024-11-16T03:51:02.000Z"
  },
  {
    "text": "Oil prices head for weekly fall on surging U.S. dollar, soft China demand",
    "timestamp": "2024-11-16T03:25:55.000Z"
  },
  {
    "text": "U.S. industrial output battered for second month by Boeing strike, hurricanes",
    "timestamp": "2024-11-16T02:58:52.000Z"
  },
  {
    "text": "Import prices post biggest increase in six months and add to U.S. inflation",
    "timestamp": "2024-11-16T02:32:17.000Z"
  },
  {
    "text": "Chinese autonomous-driving company Pony AI steers toward U.S. initial public offering",
    "timestamp": "2024-11-16T02:04:36.000Z"
  },
  {
    "text": "Manufacturing activity surges in New York region to highest level in nearly three years",
    "timestamp": "2024-11-16T01:39:09.000Z"
  },
  {
    "text": "Retail sales climb again ahead of holiday shopping season. U.S. economy still has momentum.",
    "timestamp": "2024-11-16T01:11:27.000Z"
  },
  {
    "text": "Weekend Reads: Will Nvidia’s earnings report signal a stock-market pullback?",
    "timestamp": "2024-11-16T00:46:03.000Z"
  },
  {
    "text": "Spectrum Brands’ stock slides as profit lags estimates",
    "timestamp": "2024-11-16T00:33:30.000Z"
  },
  {
    "text": "General Motors lays off about 1,000 workers to cut costs in crowded auto market",
    "timestamp": "2024-11-16T00:06:24.000Z"
  },
  {
    "text": "MLBPA, FanDuel settle lawsuit over alleged improper use of players’ names and images",
    "timestamp": "2024-11-15T23:39:27.000Z"
  },
  {
    "text": "Ben & Jerry’s lawsuit accuses parent company Unilever of censorship over Gaza",
    "timestamp": "2024-11-15T23:12:42.000Z"
  },
  {
    "text": "Tyson-Paul fight gives Netflix opportunity to show it can handle big live events",
    "timestamp": "2024-11-15T22:45:35.000Z"
  },
  {
    "text": "Our Asia Pacific Head of Strategy Yan Zhang on major trends in the Chinese market: http:// bit.ly/1MzTs0E #China",
    "timestamp": "2015-11-17T18:26:05.000Z"
  },
  {
    "text": "BREAKING: S&P Global launches #ChangePays showcasing the benefits of greater participation of women in the workforce. Watch the video to learn more and visit https:// spglobal.com/changepays",
    "timestamp": "2019-01-24T15:35:21.000Z"
  },
  {
    "text": ". @SPGlobal has agreed to merge with @IHSMarkit with a purpose to serve a broader set of customer needs and shape the markets of the future. Check out our press release to learn more: http:// ow.ly/oUEM50CxVqL Disclaimer: http:// ow.ly/r5GC50CxVqM",
    "timestamp": "2020-11-30T11:14:34.000Z"
  },
  {
    "text": "Pride, one of our People Resource Groups, OPEN Finance Women+ and @GothamFC hosted an insightful panel about LGBTQ+ inclusion and being intentional about representation. Thanks to @alikrieger and @Imdorsey96 for their advocacy in women’s sports. #inclusionisessential",
    "timestamp": "2022-09-02T14:30:19.000Z"
  },
  {
    "text": "The @IEA on March 15 raised its estimate for global #oil demand in 2023 by another 100,000 b/d as rebounding air traffic and pent-up Chinese demand push consumption to record highs. Read more in our @SPGCI article: http:// ow.ly/KKBw50NjQyL",
    "timestamp": "2023-03-16T12:00:29.000Z"
  },
  {
    "text": "From @SPGMarketIntel : @Tesla 's market cap eclipses largest US energy companies, global automakers: http:// ow.ly/2QMW50BkMui #ESG",
    "timestamp": "2020-09-09T14:01:12.000Z"
  },
  {
    "text": "S&P Global and IHS Markit are pleased to announce that they have completed their merger. Further details will be shared tomorrow, March 1st. http:// ow.ly/spXW50I5Jtx",
    "timestamp": "2022-02-28T13:41:17.000Z"
  },
  {
    "text": "Please read S&P Global President and CEO Doug Peterson’s message on taking action to affect change: https:// linkedin.com/posts/douglas- peterson-1254245_activity-6674463974496489472-SIWN …",
    "timestamp": "2020-06-05T00:35:03.000Z"
  },
  {
    "text": "This morning, @SPGlobal officially launched its new #ESG scores, based on 20 years of SAM Corporate Sustainability Assessment data, within @SPGMarketIntel 's  Xpressfeed™. Read the press release here: http:// ow.ly/hBtq50zJ3rO",
    "timestamp": "2020-05-18T12:22:23.000Z"
  },
  {
    "text": "We congratulate Martina Cheung, current President of @SPGlobalRatings , as our Board of Directors has unanimously chosen her to succeed Douglas Peterson as the Company’s President & CEO upon Doug’s retirement, effective Nov. 1, 2024. Read more. https:// okt.to/xQsOMh",
    "timestamp": "2024-06-27T21:04:02.000Z"
  },
  {
    "text": "Our Asia Pacific Head of Strategy Yan Zhang on China's evolving market & opportunities: http:// bit.ly/1kCnTwE",
    "timestamp": "2015-11-17T15:55:07.000Z"
  },
  {
    "text": "Faced with adversities that drive us apart, we must find creative ways to stay stronger together. Today, @SPGlobal publishes the S&P Global Sustainability Yearbook 2021. Learn about this year's record participation: http:// ow.ly/VIyZ50Dudig #2021SPGlobalYearbook",
    "timestamp": "2021-02-08T13:11:23.000Z"
  },
  {
    "text": "Many nations have set #NetZero Emissions by 2050 as their climate goal. Will there be enough minerals to meet the requirements? Join our experts on July 14th to better understand the challenges & potential impacts for the global economy: http:// ow.ly/ZYRq50JV1f2",
    "timestamp": "2022-07-13T15:37:59.000Z"
  },
  {
    "text": "We are now S&P Global, the world’s foremost provider of ratings, benchmarks and analytics: http:// bit.ly/1rAw7c7 #WeAreSPGlobal",
    "timestamp": "2016-04-27T22:44:57.000Z"
  },
  {
    "text": "Now available: Weekly data on the Assets and Liabilities of Commercial Banks in the United States #FedData https:// federalreserve.gov/releases/h8/cu rrent/default.htm …",
    "timestamp": "2024-11-15T21:15:50.000Z"
  },
  {
    "text": "See next week's #calendar of events:",
    "timestamp": "2024-11-15T18:00:17.000Z"
  },
  {
    "text": "A continuación, se llevaron a cabo las primeras Keynote speech del evento: Central Bank Independence and the Conduct of Monetary Policy Adriana Kugler (Federal Reserve System) Population and Firm Dynamics Hugo Hopenhayn (UCLA Economics)",
    "timestamp": "2024-11-14T20:11:31.000Z"
  },
  {
    "text": "We have posted the Federal Reserve's Supervision and Regulation Report. The report summarizes banking conditions and the Federal Reserve’s supervisory and regulatory activities.\nLearn more: https:// federalreserve.gov/publications/s upervision-and-regulation-report.htm …",
    "timestamp": "2024-11-15T16:04:22.000Z"
  },
  {
    "text": "On November 14, 2024, Chair Powell delivered a speech on the economic outlook @DallasFed : https:// federalreserve.gov/newsevents/spe ech/powell20241114a.htm …",
    "timestamp": "2024-11-15T14:34:08.000Z"
  },
  {
    "text": "Oct. #IndustrialProduction : Total -0.3%, Mfg. -0.5%, Mfg. ex. motor vehicles & parts -0.3%, Utilities +0.7%, Mining +0.3%; #CapacityUtilization 77.1% https:// federalreserve.gov/releases/g17/C urrent/ … #FedData",
    "timestamp": "2024-11-15T14:22:26.000Z"
  },
  {
    "text": "Speech by Chair Powell on the economic outlook @DallasFed : https:// federalreserve.gov/newsevents/spe ech/powell20241114a.htm … Watch live:",
    "timestamp": "2024-11-14T20:01:06.000Z"
  },
  {
    "text": "Learn more about Chair Powell:",
    "timestamp": "2024-11-14T20:04:24.000Z"
  },
  {
    "text": "On November 14, 2024, Governor Kugler delivered a speech on central bank independence and the conduct of monetary policy @Lacea_lames2024 : https:// federalreserve.gov/newsevents/spe ech/kugler20241114a.htm … https:// flickr.com/photos/comunic acionfcea/54138580142/ … https:// flickr.com/photos/comunic acionfcea/54138580062/ … https:// flickr.com/photos/comunic acionfcea/54139761354/ …",
    "timestamp": "2024-11-14T17:17:08.000Z"
  },
  {
    "text": "Speech by Governor Kugler on central bank independence and the conduct of monetary policy @Lacea_lames2024 : https:// federalreserve.gov/newsevents/spe ech/kugler20241114a.htm … Watch live:",
    "timestamp": "2024-11-14T12:02:52.000Z"
  },
  {
    "text": "Learn more about Governor Kugler:",
    "timestamp": "2024-11-14T12:02:53.000Z"
  },
  {
    "text": "@federalreserve invites comment on a report, as prescribed by law, that discusses the impact of a proposed international capital standard:",
    "timestamp": "2024-11-13T21:32:14.000Z"
  },
  {
    "text": "Scammers use phony fraud alerts and other scare tactics to steal your personal information.\nLearn more: https:// federalreserve.gov/consumerscommu nities/fraud-scams.htm …",
    "timestamp": "2024-11-13T15:59:48.000Z"
  },
  {
    "text": "Now available: quarterly survey on bank lending practices covering bank loans to businesses and households:",
    "timestamp": "2024-11-12T19:01:25.000Z"
  },
  {
    "text": "Today’s #EnforcementActions :",
    "timestamp": "2024-11-12T16:32:01.000Z"
  },
  {
    "text": "Speech by Governor Waller on payments @TCHtweets : https:// federalreserve.gov/newsevents/spe ech/waller20241112a.htm … Watch live: https:// tch.webex.com/tch/j.php?MTID =m8299374dc119b52a4535c2e5bdbc9ee8 …",
    "timestamp": "2024-11-12T15:03:09.000Z"
  },
  {
    "text": "No 401(k)? An alternative has helped US workers save more than $1.7 billion https:// yahoo.trib.al/Tx41w1y via @CNNBusiness",
    "timestamp": "2024-11-16T09:05:06.000Z"
  },
  {
    "text": "‘Just pure uncertainty.’ Small businesses are hopeful and fearful ahead of Trump’s second term https:// yahoo.trib.al/T8wXQgA via @CNNBusiness",
    "timestamp": "2024-11-16T07:44:40.000Z"
  },
  {
    "text": "Big Tech traders are in wait-and-see mode on Trump’s second term https:// yahoo.trib.al/bufyDqO via @business",
    "timestamp": "2024-11-16T05:06:08.000Z"
  },
  {
    "text": "We haven't had a consumer that's really benefited from real wage grwoth to make up for what they lost when we were coming out of the high inflation period,\" ADP chief economist Nela Richardson says. \n\nMore: https:// youtu.be/OK3lwFQly9U",
    "timestamp": "2024-11-16T02:48:00.000Z"
  },
  {
    "text": "How this chocolatier is navigating an unexpected spike in cocoa prices https:// yahoo.trib.al/Kp76OkR",
    "timestamp": "2024-11-16T02:32:04.000Z"
  },
  {
    "text": "Fed’s @neelkashkari continues to be surprised by the US economy's resilience. \n\nWatch more from Invest here: https:// finance.yahoo.com/videos/event/i nvest/ …",
    "timestamp": "2024-11-16T00:40:00.000Z"
  },
  {
    "text": "BofA strategists say buy China, Europe ahead of Trump’s Inauguration https:// yahoo.trib.al/mTn3Yh5 via @business",
    "timestamp": "2024-11-16T00:24:19.000Z"
  },
  {
    "text": "Super Micro’s looming Nasdaq deadline stokes delisting fears https:// yahoo.trib.al/j6b8mgk via @business",
    "timestamp": "2024-11-15T22:42:08.000Z"
  },
  {
    "text": "IMB CEO @ArvindKrishna says smaller AI models can be \"as good\" as large language models. \n\nMore from Yahoo Finance Invest: https:// finance.yahoo.com/videos/event/i nvest/ …",
    "timestamp": "2024-11-15T22:39:00.000Z"
  },
  {
    "text": "Gold faces worst week since 2021 as Fed signals no rate-cut rush https:// yahoo.trib.al/o9Ri2Rf via @business",
    "timestamp": "2024-11-15T22:13:04.000Z"
  },
  {
    "text": "$PLTR rose +11.14% Friday after the company announced that it would list on the Nasdaq later this month and expects to be eligible to join the Nasdaq. https:// yahoo.trib.al/7aNpGXe",
    "timestamp": "2024-11-15T21:40:10.000Z"
  },
  {
    "text": "\"We have built the largest hydrogen plant for green technology in the world outside China and Georgia,\" Plug Power CEO Andy Marsh says. \"We're about to build one three times larger in Texas ... and [will build] five additional plants over time.\" \n\nFull comments:",
    "timestamp": "2024-11-15T21:37:35.000Z"
  },
  {
    "text": "Richmond Fed’s Barkin expects inflation will fall into next year, hints at slowing rate-cut pace https:// yahoo.trib.al/CbGvgLr by @Jenniferisms",
    "timestamp": "2024-11-15T21:28:55.000Z"
  },
  {
    "text": "\"This market perception now that inflation is very likely coming back is true,\" Sizemore Capital Management CIO Charles Sizemore says. \"It's really debatable if we really ever conquered inflation. I think the Fed did a little victory lap too early.\"",
    "timestamp": "2024-11-15T21:21:30.000Z"
  },
  {
    "text": "Oklo co-founder and CEO Jacob Dewitte on Elon Musk's DOGE role:",
    "timestamp": "2024-11-15T21:10:37.000Z"
  },
  {
    "text": "Three reasons to invest in $IK , according to Hennessy Japan Fund portfolio manager Masa Takeda: \n\n1. Inbound tourism to Japan rising\n2. Japan normalizing rates\n3. Cheap valuation",
    "timestamp": "2024-11-15T20:58:52.000Z"
  },
  {
    "text": "Sports unites us. It has the unique power to excite and inspire. @Nasdaq proudly sits at the intersection of the sports and business eco-system creating unique experiences and connecting communities of athletes, fans, commissioners, media, and thought leaders.\n\nAs the",
    "timestamp": "2024-07-26T20:14:09.000Z"
  },
  {
    "text": "Each index provider appears to think differently when defining size categories. On top of that, index inclusion rules mean not all stocks qualify for all index families. @Nasdaq Chief Economist @phil_mackintosh explains: http:// spr.ly/6014sJiKg #MarketMakers",
    "timestamp": "2024-11-13T21:29:12.000Z"
  },
  {
    "text": "Say hello if you see @nasdaq at the 14th annual @cnbc #DeliveringAlpha Investor Summit! @cnbcevents Follow along with the agenda here: https:// cnbcevents.com/delivering-alp ha-2024/ …",
    "timestamp": "2024-11-13T20:37:22.000Z"
  },
  {
    "text": "Nasdaq is proud to attend the 14th Annual @CNBC #DeliveringAlpha Investor Summit as a proud sponsor! Be sure to come visit us at our 'Rewrite Cafe'  where we are 'delivering'...coffee! @cnbcevents",
    "timestamp": "2024-11-13T20:20:04.000Z"
  },
  {
    "text": "Navigating today's economic environment requires an approach that goes beyond traditional data analysis, involving examination of economic policies, regulatory changes, and global events.\n\nLearn more about why boards and leaders need thoughtful analysis: http:// spr.ly/6010sJph0",
    "timestamp": "2024-11-13T19:58:25.000Z"
  },
  {
    "text": "The integrity of disclosure on cybersecurity matters can impact corporate reputation, access to capital, and more. So, how can boards provide effective oversight? Discover a cyber incident disclosure readiness checklist for boards here: http:// spr.ly/6015SxRYN",
    "timestamp": "2024-11-13T17:00:02.000Z"
  },
  {
    "text": "@LPGA Tour Professional & @KPMG Ambassador Mariah Stackhouse ( @MoStacksBirdies ) is no stranger to calculated risks. Hear about what golf has taught Stackhouse about the importance of betting on herself.",
    "timestamp": "2024-11-13T15:01:10.000Z"
  },
  {
    "text": ". @Nasdaq CEO and Chairman Adena Friedman advises her sons and other younger people looking to invest to get educated before jumping in head first. #FortuneGlobalForum",
    "timestamp": "2024-11-12T19:40:06.000Z"
  },
  {
    "text": "Over 30% of board members, executives, and governance professionals emphasize focus on AI and cybersecurity to enhance board composition. Review @Nasdaq 's 2024 Global Governance Pulse survey findings for more prioritized board competencies: http:// spr.ly/6018s6GvY",
    "timestamp": "2024-11-12T16:00:15.000Z"
  },
  {
    "text": "Across every area of the financial system, threats to security are growing in scale and sophistication. Discover how Nasdaq helps banks combat financial crime: http:// spr.ly/6014s6HmY",
    "timestamp": "2024-11-12T13:35:33.000Z"
  },
  {
    "text": "Beijing is key to Brazil's grand economic plans. Trump's aggressive stance on China could thwart that",
    "timestamp": "2024-11-16T11:05:03.000Z"
  },
  {
    "text": "The day after devastating floods in Valencia, lawmakers made controversial changes in how the state broadcaster is run. Here's the Brussels Edition",
    "timestamp": "2024-11-16T11:01:04.000Z"
  },
  {
    "text": "If Donald Trump follows through on his promised tariffs, the United States will likely trade much, much less with other countries. But what about the rest of the world?",
    "timestamp": "2024-11-16T10:44:04.000Z"
  },
  {
    "text": "China's stock rally has sparked a market frenzy, with amateur investors offering trading tips on the streets of Shanghai. But regulators aren't welcoming the speculation.",
    "timestamp": "2024-11-16T10:43:03.000Z"
  },
  {
    "text": "For the millions living in and around Baku, hosting the COP29 climate summit has brought disruption — and even hardship — to their daily lives.",
    "timestamp": "2024-11-16T10:41:01.000Z"
  },
  {
    "text": "Protesters marched to Novo Nordisk's South African headquarters to demand greater access to affordable human insulin and oppose the phase-out of easy-to-use pens",
    "timestamp": "2024-11-16T10:38:59.000Z"
  },
  {
    "text": "New Zealand is considering charging tourists when they visit national parks and other public land.\n\nMany of its landmark destinations such as Milford Sound, Aoraki Mount Cook and the Tongariro Alpine Crossing are in such parks",
    "timestamp": "2024-11-16T10:15:03.000Z"
  },
  {
    "text": "Billionaires Jensen Huang and Masayoshi Son joke about how SoftBank was once Nvidia's largest shareholder — before dumping its stake. \n\nThe two are now joining forces on an AI supercomputer https:// trib.al/mYGVfkh",
    "timestamp": "2024-11-16T10:10:06.000Z"
  },
  {
    "text": "Gazprom is sending natural gas to Europe via Ukraine at normal levels even after cutting off one of its longest partners, Austria’s OMV",
    "timestamp": "2024-11-16T10:09:02.000Z"
  },
  {
    "text": "China’s President Xi Jinping wants a “powerful currency” that is stable enough to play a rising role in global trade. Donald Trump’s return looks set to challenge that ambition.",
    "timestamp": "2024-11-16T10:08:05.000Z"
  },
  {
    "text": "Russia’s war in Ukraine, nearing its 1,000th day, must be brought to an end in 2025, Zelenskiy said",
    "timestamp": "2024-11-16T10:07:01.000Z"
  },
  {
    "text": "As Donald Trump threatens to impose tariffs on the entire world, Xi Jinping is once again wasting no time in positioning himself as the premier defender of the international trading system.",
    "timestamp": "2024-11-16T10:05:05.000Z"
  },
  {
    "text": "7 Habit Changes That Will Rock Your Business in Unexpected Ways via @smallbiztrends @Toyota #TheToyotaEffect #ad",
    "timestamp": "2015-10-08T16:28:22.000Z"
  },
  {
    "text": "The Best Black Friday Deals for Small Business 2018 http:// sbt.me/b2d By @anniehp",
    "timestamp": "2018-10-29T17:31:10.000Z"
  },
  {
    "text": "A restaurant owners’ association, three individual restaurants and two fitness venues filed a lawsuit against NYC Mayor Bill de Blasio in regards to the new vaccine passport requirement. https:// zcu.io/rDMd #smallbiz",
    "timestamp": "2021-08-27T20:00:01.000Z"
  },
  {
    "text": "If you're looking for #businessadvice , there's a lot of great information on #growingyourbusiness in my new article on The Growth Center @Microsoft365 .  Check it out: https:// zurl.co/GvXf #Sponsored",
    "timestamp": "2019-07-11T13:48:52.000Z"
  },
  {
    "text": "10 of the most popular WordPress themes and what makes them stand out from the alternatives. http:// bit.ly/2lvZOKL https:// pic.x.com/cesU9YP00Q",
    "timestamp": "2017-03-01T00:30:29.000Z"
  },
  {
    "text": "Outsourcing isn’t right for every situation. Here's 20 advantages and disadvantages to consider. http:// bit.ly/2m9dcDa",
    "timestamp": "2017-02-25T21:35:11.000Z"
  },
  {
    "text": "50 social media management tools that can help you build your business’s presence online. http:// bit.ly/2m516xW https:// pic.x.com/mfMtSsuYBR",
    "timestamp": "2017-02-25T19:25:09.000Z"
  },
  {
    "text": "Via @BizSugar : 3 Social Media Graphics Tools to Up Your Small Business Marketing Game http:// ow.ly/gMYK509Ot9B",
    "timestamp": "2017-02-26T03:01:26.000Z"
  },
  {
    "text": "How to Avoid Double Taxation with an S Corporation http:// sbt.me/7ru By @corpnetnellie",
    "timestamp": "2017-02-26T17:00:06.000Z"
  },
  {
    "text": "Savvy Sexy Social's Amy Schmittauer Shares Insights on New YouTube Live Mobile http:// sbt.me/7rv By @socialalex",
    "timestamp": "2017-02-26T20:00:42.000Z"
  },
  {
    "text": "Via @BizSugar : 7 Ways to Use Twitter Video to Attract the Right Followers http:// ow.ly/yyPh509Pb6j",
    "timestamp": "2017-02-26T20:00:56.000Z"
  },
  {
    "text": "Extreme California Weather Highlights the Importance of Being Prepared (Watch) http:// sbt.me/7rw By @anniehp",
    "timestamp": "2017-02-26T23:01:07.000Z"
  },
  {
    "text": "The Book \"Getting to Yes And\" Shows How to Use Improv in Business http:// sbt.me/7rt By @creativedropout",
    "timestamp": "2017-02-26T14:00:47.000Z"
  },
  {
    "text": "Bring Your Business Into the Future at ICON17 http:// sbt.me/7rs",
    "timestamp": "2017-02-25T18:30:25.000Z"
  },
  {
    "text": "Via @BizSugar : Five Time Management Mistakes http:// ow.ly/qOfi509P4rF",
    "timestamp": "2017-02-26T18:01:36.000Z"
  },
  {
    "text": "Via @BizSugar : 3 Ways Sales Is Changing With Artificial Intelligence http:// ow.ly/ihKO509QZyC",
    "timestamp": "2017-02-28T01:00:33.000Z"
  },
  {
    "text": "eBay deploys artificial intelligence solutions to help its sellers become more competitive. http:// bit.ly/2l8SIJE",
    "timestamp": "2017-02-28T00:30:14.000Z"
  },
  {
    "text": "Highlights from our recent #smallbizchat on how to grow an online #business . http:// bit.ly/2l5C8yp",
    "timestamp": "2017-03-02T21:35:15.000Z"
  },
  {
    "text": "\"Success is liking yourself, liking what you do, and liking how you do it.\" - Maya Angelou #TuesdayThoughts #TuesdayMotivation #SmallBizQuote",
    "timestamp": "2020-10-20T10:00:01.000Z"
  },
  {
    "text": "Via @Fiverr : Starting a Career While Starting a Family: Aldo’s Seller Success Story http:// ow.ly/lZ50509QUA8",
    "timestamp": "2017-02-28T00:33:18.000Z"
  },
  {
    "text": "4 Simple Ways to Improve Your Customer Service (INFOGRAPHIC) http:// sbt.me/7s7 By @dashburst",
    "timestamp": "2017-02-28T10:01:09.000Z"
  },
  {
    "text": "Here's a one-pager with links to our latest market commentary, financial planning and wealth management insights, and social media accounts. Articles Podcasts Videos https:// schwab.com/scfrcontent",
    "timestamp": "2024-05-30T20:46:56.000Z"
  },
  {
    "text": "Number of the Day: 22%. That’s the share of the S&P 500 index held by just five stocks— a degree of concentration that is higher than during the dot-com era that preceded the early-2000s tech bust. https:// schwab.com/resource-cente r/insights/content/market-perspective …",
    "timestamp": "2020-07-20T13:44:26.000Z"
  },
  {
    "text": "A strong U.S. dollar changes everything: http:// schwab.com/public/file?cm sid=P-7340887&cv4 … white paper by @KathyJones",
    "timestamp": "2016-03-07T21:43:36.000Z"
  },
  {
    "text": "2024 Fixed Income Outlook: The case for lower interest rates in 2024 is straightforward, but the path is likely to be rocky. We expect lower Treasury yields and positive returns for investors. Click here for an in-depth report from @KathyJones : https:// schwab.com/learn/story/fi xed-income-outlook-rocky-road-bond-market …",
    "timestamp": "2023-12-06T18:33:30.000Z"
  },
  {
    "text": "Our newest podcast, On Investing, launches Oct. 27. @KathyJones and @LizAnnSonders will bring context to conversations around equities, fixed income and the economy. They'll share insights on what's moving the markets and answer investor questions.",
    "timestamp": "2023-10-16T15:43:22.000Z"
  },
  {
    "text": "Market on Close: 2023 global stock market performance Stock rally and earnings estimates Trading and technical analysis Recent economic reports @JeffreyKleintop and Nate Peterson join @OJRenick on @SchwabNetwork 's Big Picture Panel. https:// x.com/i/broadcasts/1 BdxYrLgmpZKX …",
    "timestamp": "2023-12-20T20:52:58.000Z"
  },
  {
    "text": "Schwab Market Update: Stocks are rising as the consumer price index (CPI) indicates core prices (excluding food and energy) were higher in February than in January, but lower than in February 2022. Our latest Market Update: https:// schwab.com/resource-cente r/insights/content/schwab-market-update …",
    "timestamp": "2023-03-14T15:43:24.000Z"
  },
  {
    "text": "Market on Close: @LizAnnSonders and Cooper Howard share their latest market perspectives with @OJRenick . @TDANetwork https:// x.com/i/broadcasts/1 YqKDoRbLyBxV …",
    "timestamp": "2023-03-15T19:51:40.000Z"
  },
  {
    "text": "Market on Close: @LizAnnSonders and Michelle Gibley join @OJRenick on Market on Close to discuss: Retail sales data Fed expectations U.S. debt-ceiling issue China's economic recovery Watch @TDANetwork https:// x.com/i/broadcasts/1 vAxRAWBXRkJl …",
    "timestamp": "2023-05-16T19:51:43.000Z"
  },
  {
    "text": "Market on Close: Rally in the Treasury market Look-ahead to this week's CPI report Global inflation Chinese stock market performance @KathyJones and Michelle Gibley kick off the week with @OJRenick on @SchwabNetwork 's Big Picture Panel. https:// x.com/i/broadcasts/1 mnGepegNdZKX …",
    "timestamp": "2024-01-08T20:51:25.000Z"
  },
  {
    "text": "We've believed all year that the economy has had a series of \"rolling recessions\" affecting various industries. The question is whether it will eventually become a formal recession. @LizAnnSonders , @JeffreyKleintop , and @KathyJones share their perspective: https:// schwab.com/learn/story/ma rket-perspective …",
    "timestamp": "2023-08-11T16:56:51.000Z"
  },
  {
    "text": "Market on Close: @LizAnnSonders discusses the U.S. stock market and economy with @OJRenick on @SchwabNetwork 's Big Picture Panel segment. #economy #CPI #stocks https:// x.com/i/broadcasts/1 dRKZEzdVmwxB …",
    "timestamp": "2023-10-12T19:55:24.000Z"
  },
  {
    "text": "Today's Closers Panel: @LizAnnSonders and Collin Martin join @OJRenick on @TDANetwork. https:// x.com/i/broadcasts/1 yNxaNnWAknKj …",
    "timestamp": "2023-01-24T20:49:47.000Z"
  },
  {
    "text": "Market on Close: First trading day of 2024 Economic and Fed expectations for the new year Trading and technical analysis\n\nNate Peterson and Collin Martin share their insights with @OJRenick on the @SchwabNetwork 's Big Picture Panel. https:// x.com/i/broadcasts/1 OyKAWqoNMgJb …",
    "timestamp": "2024-01-02T20:54:02.000Z"
  },
  {
    "text": "How chefs in the NBA bubble make 4,000 meals a week",
    "timestamp": "2020-10-06T01:04:56.000Z"
  },
  {
    "text": "This man played Barney the dinosaur for 10 years — here's what it was like",
    "timestamp": "2017-06-07T00:37:06.000Z"
  },
  {
    "text": "You can take a seat anywhere with this wearable chair",
    "timestamp": "2017-07-24T21:20:06.000Z"
  },
  {
    "text": "Don't try to open the door",
    "timestamp": "2019-01-21T08:04:00.000Z"
  },
  {
    "text": "Inside the life and career rise of YouTube star Shane Dawson's video editor, Andrew Siwicki",
    "timestamp": "2019-12-04T15:47:03.000Z"
  },
  {
    "text": "Why 100% agave tequila is so expensive",
    "timestamp": "2020-10-13T03:35:04.000Z"
  },
  {
    "text": "A SpaceX flight attendant said Elon Musk exposed himself and propositioned her for sex, documents show. The company paid $250,000 for her silence.",
    "timestamp": "2022-05-19T22:17:55.000Z"
  },
  {
    "text": "Jeff Bezos says he's giving $10 billion to fight climate change, about 7.7% of his net worth",
    "timestamp": "2020-02-17T18:37:10.000Z"
  },
  {
    "text": "This CEO believes in his company's bulletproof glass so much that he sat at the wheel as shots were fired",
    "timestamp": "2018-05-14T02:20:00.000Z"
  },
  {
    "text": "What it's like inside a Canadian marijuana greenhouse",
    "timestamp": "2020-07-19T14:02:21.000Z"
  },
  {
    "text": "Justin Bieber's new music is blowing away people who never took him seriously http:// read.bi/1LW3E5g",
    "timestamp": "2015-09-08T20:56:15.000Z"
  },
  {
    "text": "Black Friday Deal: 47% OFF IBD Digital®! Get 1 YEAR of IBD Digital® for just $199—our best deal of the year! Unlock expert stock insights, analysis, and more for your investing journey. Don’t wait, this offer won’t last! https:// ow.ly/tHhV50U80If",
    "timestamp": "2024-11-15T17:03:38.000Z"
  },
  {
    "text": "Investing Gains Clout With Health Savings Account Holders https:// investors.com/news/health-sa vings-account-holders-gain-investment-clout/ … #HSA",
    "timestamp": "2024-11-16T02:00:22.000Z"
  },
  {
    "text": "Netflix, Five Other Gems Soar Into Profit Zones In Hot November Rally",
    "timestamp": "2024-11-16T00:00:34.000Z"
  },
  {
    "text": "GE Stock Pulls Off Feat Neither Nvidia Nor Any Other Mag 7 Has",
    "timestamp": "2024-11-15T22:00:54.000Z"
  },
  {
    "text": "Stock Market Today with @JustinNielsen and @mwebster1971 : Market pulls back. How worried should you be? Flutter Entertainment, Square, AppLovin in focus $FLUT $SQ $APP",
    "timestamp": "2024-11-15T21:09:16.000Z"
  },
  {
    "text": "#IPO Watch: China Stock Atour Lifestyle Shows New Buy Point After 91% Rally",
    "timestamp": "2024-11-15T21:01:38.000Z"
  },
  {
    "text": "This Satellite Firm Aims To Revolutionize Communication. The Stock Is Taking Off.",
    "timestamp": "2024-11-15T20:40:47.000Z"
  },
  {
    "text": "Two #Oil Stocks Hit New Highs As They Ride The Trump Wave",
    "timestamp": "2024-11-15T20:30:28.000Z"
  },
  {
    "text": "IBD Stock Of The Day Rebounds Near A Buy Point",
    "timestamp": "2024-11-15T20:01:25.000Z"
  },
  {
    "text": "Super Micro Stock In Spotlight As Delisting Deadline Nears",
    "timestamp": "2024-11-15T19:02:23.000Z"
  },
  {
    "text": "How Reddit Surprised Wall Street With 185% Post-IPO Surge",
    "timestamp": "2024-11-15T18:01:44.000Z"
  },
  {
    "text": "Are you considering any new investment strategies for the upcoming year?",
    "timestamp": "2024-11-15T17:43:58.000Z"
  },
  {
    "text": "Carvana Rival Is 'Coiled Spring' Under Used Car Business Hood",
    "timestamp": "2024-11-15T17:03:18.000Z"
  },
  {
    "text": "BREAKING: China says it will cut import tariffs for goods including frozen pork, pharmaceuticals, paper products and some high-tech components starting from Jan. 1, according to a statement from the Ministry of Finance https:// bloom.bg/2PNE2Bz",
    "timestamp": "2019-12-23T01:31:37.000Z"
  },
  {
    "text": "Pakistan’s government under Nawaz Sharif’s party had the best performance in managing the economy over the past three decades compared with rivals, according to Bloomberg Economics",
    "timestamp": "2024-01-22T07:01:55.000Z"
  },
  {
    "text": "China's central bank injects 120 billion yuan ($18.6 billion) into the banking system after concern over a debt crisis at Evergrande roiled global markets",
    "timestamp": "2021-09-22T03:50:49.000Z"
  },
  {
    "text": "A Turkish football match in Riyadh was canceled after players weren't allowed to take the field wearing T-shirts with their country’s secular founding leader Ataturk’s photo https:// trib.al/OJWsnpR",
    "timestamp": "2023-12-29T20:06:59.000Z"
  },
  {
    "text": "Trump’s trade chief lectures his boss and gets an earful in return https:// bloom.bg/2SWt0gj",
    "timestamp": "2019-02-23T17:16:17.000Z"
  },
  {
    "text": "Spanish Prime Minister Pedro Sanchez declines to testify in a criminal inquiry that targets his wife’s business activities",
    "timestamp": "2024-07-30T11:51:16.000Z"
  },
  {
    "text": "The Ever Given appears ready to give the Suez Canal another try https:// trib.al/VaBkzkz",
    "timestamp": "2021-12-08T17:10:17.000Z"
  },
  {
    "text": "King Charles announces that UK Prime Minister Rishi Sunak's government will \"continue to take action... to ease the cost of living for families\" https:// trib.al/qO6ywcl",
    "timestamp": "2023-11-07T11:55:43.000Z"
  },
  {
    "text": "Taib Mahmud, the politician and tycoon who became known for enabling the destruction of Malaysia's rainforests in pursuit of economic development, has died at 87",
    "timestamp": "2024-02-21T02:07:01.000Z"
  },
  {
    "text": "Indian Home Affairs Minister Amit Shah authorized a wave of violence across Canada that included extortion and homicides, said a senior Canadian government official",
    "timestamp": "2024-10-29T20:32:57.000Z"
  },
  {
    "text": "Spain’s Pedro Sanchez is giving the country five days to think about what life would be like without him",
    "timestamp": "2024-04-26T05:05:14.000Z"
  },
  {
    "text": "Mike Pence criticizes China’s actions against protesters in Hong Kong while calling for greater engagement between the world’s two biggest economies",
    "timestamp": "2019-10-24T16:12:44.000Z"
  },
  {
    "text": "BREAKING: U.S. adds 128,000 jobs in October, well surpassing expectations of 85,000 https:// bloom.bg/2qfmm7j",
    "timestamp": "2019-11-01T12:30:56.000Z"
  },
  {
    "text": "Japan to offer financial assistance to small businesses as part of a second round of emergency measures against the coronavirus",
    "timestamp": "2020-03-08T07:38:11.000Z"
  }
]