[
  "#Ascending artist #JordanAdetunji shouts out some of his favorite tracks rn ",
  "Lill Durk faces life in prison if convicted of orchestrating a deadly 2022 plot against a rival.",
  "That’s because they’re better, NEXT",
  "Happy Birthday to this killer queen @jeffreestar ",
  "Lil Wayne dresses up as Freddy Kruger for Halloween ",
  "400 socially-distanced musicians play outside the Houses of Parliament in a powerful musical protest.  ",
  "A$AP Rocky getting cleaned up at the barbershop with Rihanna and squad ",
  "1994: The 40 Best Records From Mainstream Alternative’s Greatest Year\n\nLIST: https://rollingstone.com/music/music-lists/1994-the-40-best-records-from-mainstream-alternatives-greatest-year-29203/…",
  "Happy 21st Birthday to @jackaverymusic from @whydontwemusic! Don't party too hard \n: @laurajunekirsch",
  "REVIEW: Jin Is Ready to Rock on ‘Happy’\n\nThe BTS member’s debut solo LP goes from New Wave to unadorned piano balladry. \n\nMore: https://rollingstone.com/music/music-album-reviews/jin-happy-review-1235166951/…",
  "New music from @Anitta & @Saweetie, \"Faking Love\" is out now! \n\nListen to their new song here: https://anitta.lnk.to/fakinglove",
  "@RapRadar x @NICKIMINAJ HQ #GagCity",
  "Your Official Singles Chart is fully loaded  See the Top 100 all in one place here: https://officialcharts.com/charts/singles-chart/…",
  "They're bringing guitars back to the radio & are this month's cover stars–@5SOS! Preorder now: http://altpress.com/preorder",
  "3 absolutely essential tracks to add to your hype playlist  Listen now: https://ow.ly/uxiF50U8kR6",
  "#ChaseAtlantic talks us through their unique sound and influences. Tap into their latest offering, 'LOST IN HEAVEN' now  https://ow.ly/tsw650U7il5",
  "Bay Area stand up! Listen to @G_Eazy on the #RapRadarPodcast http://apple.co/1SQorKd",
  "HERE'S A GIFT!  My #MTVFreshOut playlist featuring @tatemcrae, @ShawnMendes, @Jessiereyez & more! \n\nSpotify: https://open.spotify.com/playlist/6VaywVwqJi2yqv7UIpqkAT?si=f343be75597a4282&nd=1&dlsi=100b92502f88419d…\nApple Music: https://music.apple.com/us/playlist/mtv-fresh-out/pl.8ffde773d9c8496984fb727222899df4…",
  "Can't fully celebrate a new @ShawnMendes release without taking second to admire ALLLL of his albums ",
  "Modest! Management on @NiallOfficial's triumphant Royal Albert Hall livestream... And what comes next https://musicweek.com/management/read/modest-management-on-niall-horan-s-triumphant-royal-albert-hall-livestream-and-what-comes-next/081934… #NiallLiveAtRoyalAlbertHall",
  "070 Shake and Courtney Love come together to cover a Tim Buckley song",
  "Louis Tomlinson makes his Alternative Press cover debut for September 2022. \n\n Read the full cover story online now, here’s some highlights.\n\nhttps://altpress.com/louis-tomlinson-faith-in-the-future-interview/…",
  "ANYWAY, congratulations to @LittleMix for winning 2017’s Popjustice #TwentyQuid Music Prize. Here’s what happened.",
  "\"We've been doing bits and bobs...\"\n\nNew music, unreleased songs and following #FineLine, what's next for @Harry_Styles? https://musicweek.com/talent/read/sugar-high-what-next-for-harry-styles-after-grammys-win/082846… #HarryStyles #HarryStylesgrammy #GRAMMYs",
  "Mustard Asks Ex-Wife Chanel Thierry to Stop Bashing Him Online\n\nDETAILS ",
  " Shawn (2024)",
  "HERE YOU GO. The Top 45 Singles Of 2015. http://popjustice.com/articles/the-top-45-singles-of-2015/139932/…",
  "Stop the clock I’ve found the best-named product in the entire history of fruit protection",
  " NEW TO THE PLAYLIST \n@darkoo & Dess Dior\n@Drake\n@Englishteac_her\n@Hozier\n@PostMalone\n@tsha909 & @rosegray_ \n\nhear all the tracks on radio 1 on @bbcsounds ",
  "Sade speaking about peace and happiness ",
  "Quite into the idea of Somebody Else in a field in the dark https://x.com/Truman_Black/status/836833900076937218…",
  "That @LilNasX & @bts_bighit performance was wild  #Grammys",
  "A humble, bluesy pop record that sent a previously unknown singer-songwriter to the stratosphere",
  "it's a @SabrinaAnnLynn  take over on this weeks official chart! ",
  ". @bts_bighit finish ahead of @taylorswift13 as IFPI's No.1 global act of 2020\nhttps://musicweek.com/talent/read/ifpi-names-bts-as-biggest-global-act-of-2020/082751… #BTS",
  "Words cannot explain how proud I am of @flolikethis & the release of their DEBUT ALBUM, 'Access All Areas'!!",
  "Oof",
  "A fan gifts Big Sean a phone full of beats that they’ve been accumulating since 2015 ",
  ". @Louis_Tomlinson signs global deal with BMG for new album https://musicweek.com/labels/read/louis-tomlinson-signs-global-deal-with-bmg/083225…",
  "Pain & Gain: Jake Paul Defeats Mike Tyson in Stunt Netflix Boxing Match\n\nThe 58-year-old former heavyweight champion took on the YouTuber-turned-fighter in a match that several states refused to sanction.\n\nStory: https://rollingstone.com/music/music-news/jake-paul-mike-tyson-boxing-win-1235166434/…",
  "Huge congrats to #NathanEvans (@NathanEvanss), who scores his first-ever Official Top 40 album with #1994 this week \n\nSee your all-new Top 100 right here: https://officialcharts.com/charts/albums-chart/…",
  "Malcolm X's daughters, along with attorney Benjamin Crump, have filed at $100 million lawsuit against the CIA, FBI & NYPD for their alleged role in the death of their father.",
  "Heaven nightclub shut down after member of staff arrested and charged with rape",
  "Cardi B hits back at Candace Owens asking if she was paid to speak at Kamala Harris’ campaign event\n\n\"Like please girl you know damn well I’ll argue you down about politics FOR FREE\"",
  "HERE COMES THE PAIN: SLIPKNOT ARE STILL IN COMMAND\n@slipknot for @AltPress Fall 2024\n\nPreorder your copy now https://altpress.com/slipknot-alternative-press-fall-2024-cover-announcement/…\n\nInterview by @cpayneonaplane\nPhotos by Jonathan Weiner",
  "A creative misalignment that doesn’t make particularly canny use of either musician’s skills",
  "Denzel revealed it's been decades since he's had to audition. He's a legend...why should he have to?",
  "RAPRADAR: Video: WizKid Ft. Buju “Mood” https://ift.tt/yw1vh3o",
  "The John Lewis ad but with young Marshmello being given an empty bucket",
  "New York! We’re so excited for @whydontwemusic to join us at Songkick HQ next week!  Head this way to enter for the chance to win tickets to #SongkickLive:  http://bit.ly/2ZwufBe",
  "This Week in Black News\n\nIt's time to celebrate the wins, big and small! Whether it's a nomination, history brakin’ , or community makin’, let’s lift each other up! Drop your good news below and let’s spread that joy! ",
  "“I think the thing that should really have longevity are the games, characters and world ... That’s how we think about Xbox today.”\n\nXbox CEO Phil Spencer tells Rolling Stone there will still be a box to buy: https://rollingstone.com/culture/rs-gaming/xbox-console-future-cloud-ceo-phil-spencer-1235166597/…",
  "RAPRADAR: Video: WizKid Ft. Tay Iwar,Projexx “True Love” https://ift.tt/dKr1UqE",
  "The boys from @whydontwemusic talk touring, late night Walmart trips & more on Stories from The Road  Watch the full video on our Youtube channel: http://t.ly/52Ya",
  "KENDRICK LAMAR JUST DROPPED A NEW SONG ",
  "boywithuke  chandol. Welcome in this new era with his brand new album, 'Burnout'  @boywithukes https://ow.ly/MNhc50U86R0",
  "Zach Bryan and Bruce @Springsteen link up for Rolling Stone's #MusiciansOnMusicians 2024 cover   \n\nTwo great American songwriters meet up in NJ & go deep on the perils of stardom, classic country, the troubled state of the union, and more.  \n\nRead/Watch: https://rollingstone.com/music/music-features/bruce-springsteen-zach-bryan-songwriting-country-music-america-1235126859/…",
  "Which artist do you think had the biggest 2024?",
  "Amazing quote in the press release launching Lewis Capaldi’s album: “I hope people don’t think it’s shit. I mean don’t get me wrong there will be one or two stinkers on there, but I’m only human and we all make mistakes, but as a whole I think it’s pretty fucking good.”",
  "Little Mix's 'Move' is the 2014 Popjustice Twenty Quid Music Prize winner.",
  "RAPRADAR: Video: WizKid “Money & Love”",
  " Another Number 1! \n\nMichael Ball OBE (@mrmichaelball) and Alfie Boe OBE (@AlfieBoe) celebrate their fourth chart-topping album with #TogetherAtHome \n\nSee the full Top 100 here: https://officialcharts.com/charts/albums-chart/…\n#MichaelBall #AlfieBoe",
  "My Top 5 favorite things include surprising my @CobraKaiSeries besties – so here's a BRAND NEW PLAYLIST to celebrate season 6, part 2 ",
  "BACKBONE has gone straight to number! congrats @stormzy  and @chaseandstatus !!",
  "TRACK OF THE DAY - #R2RMoe - AS LONG AS YOU REAL\nhttps://ow.ly/jxRc50U861B",
  "Fans react to Netflix coverage of Mike Tyson vs Jake Paul: “I want my money back, and I didn’t even spend anything”",
  "Pharrell Williams heckled by animal protesters, offers them a hug\n\nTwo similar incidents have occurred within the past two months between Williams and animal rights protesters",
  "Drake put his money on Mike Tyson \n\nWho yall got?",
  "Zach Bryan Completes Deferred Prosecution Agreement, 2023 Arrest Case Closed",
  "Elton John: “When my kids were born, I didn’t want them to have any fear – they’re not interested in being in the limelight”",
  "Here’s What Korean Women Think of the 4B Movement Spreading to the U.S.    \n\nMore: https://rollingstone.com/culture/culture-features/4b-korean-women-movement-u-s-1235164807/…",
  "The Queen of Christmas is back \n@MariahCarey has her eyes set on #XmasNo1... http://officialcharts.com/chart-news/gracie-abrams-thats-so-true-number-1-week-2/…",
  "Ray J opens up about his suicide attempt in a recent interview with Pastor Jamal Bryant",
  "Watch @Mr_Camron speak on breaking into the toilet paper business #RapRadarPodcast http://tidal.com/rapradar",
  "The incredible @linkinpark cover the December edition of Music Week! Plus: Frame Artists, @mirandalambert, @victoriacanal, Sat Bisla, @cookingvinyl, tributes to Quincy Jones and Liam Payne and much, much more… https://musicweek.com/media/read/linkin-park-cover-the-december-edition-of-music-week/090818…",
  "I interviewed Halsey. She talked a lot. http://popjustice.com/articles/halsey-interview-i-dont-believe-people-who-say-theyre-themselves-all-the-time/139218/…",
  "It’s Time! iHeartRadio Stations Make the Flip to Christmas Music for 2024 Holiday Season",
  "“Bad Bunny numbers, it’s a robbery. $500 million just for Aubrey” ",
  ".@sarahstorytweet getting mistaken for @jadethirlwall...and she just goes with it ",
  "FINALLY new music from Shawn Mendes what's your fave song? ",
  "Time to wheel out the two greatest tweets of 2014.",
  "Premiering the hottest Hip Hop releases from your favs tonight on @HipHopNation",
  "MY. CHEMICAL. ROMANCE.",
  ". @BTS_twt win the first ever IFPI Global Album award for 2020’s biggest record across all formats\nhttps://musicweek.com/news/read/bts-win-first-ever-ifpi-global-album-award-for-2020-s-biggest-record-across-all-formats/082797… #BTS #IFPIGlobalAlbumAllFormatChart #mapofthesoul7",
  ".@rauwalejandro's new album introduces us to Raúl, a Puerto Rican immigrant living in New York in the '70s. Listen to Cosa Nuestra, out now: http://apple.co/CosaNuestra",
  "BTS are named IFPI's biggest global act for the second year running - the first time that's been achieved by any artist https://musicweek.com/news/read/bts-are-named-ifpi-s-biggest-global-act-for-the-second-year-running/085285… #BTS",
  " Official Albums Chart debut \n#Fimiguerrero (@fimiguerrero), #Len and #LanceyFoux (@lanceyfouxx) bag their first collaborative Albums Chart entry with #CONGLOMERATE \n\nCheck out the full Top 100 here: https://officialcharts.com/charts/albums-chart/…",
  "JUST IN: Poland to award Lil Yachty with a statue for successfully transporting the wok to their country ",
  "If this is your way of proposing, @arialisslomusic – I accept!",
  "Rick Ross continues to troll Drake after dropping \"The Heart Part 6\" ",
  "On a sequel to a 2012 mixtape, the Miami rapper takes a playful romp through Southern rap history. Instead of devotional revivalism, he treats regional traditions as a springboard for stylistic play",
  "The new Little Mix single is incredible. Here are some facts about it: http://popjustice.com/briefing/little-mixs-new-single-love-me-like-you-a-series-of-solid-facts/138435/…",
  "Maxo Kream's new album presents itself as a moment of mid-career reflection but feels more like a facsimile of his past work",
  "Yo Pierre! Watch @iamjamiefoxx speak on @pierrebourne’s producer tag!  #RapRadarPodcast: https://link.chtbl.com/RapRadarPodcast",
  "Suddenly, I NEEEED to go to karaoke with bankerrz to see this PERFORMANCE of \"1+1\" by @Beyonce \n\nSee more of her #MTVPush content here → http://youtube.com/mtv",
  "Artists like Parannoul and Asian Glow are turning a uniquely Korean sound into a global phenomenon",
  "The first video game score in the Classic FM Hall of Fame 2024. \n\nJapanese composer Yoko Shimomura’s music for Final Fantasy XV is voted into your Top 300.\n\n#HallOfFame",
  "Taylor Swift’s 8 best moments from the first Eras Tour show in Toronto.",
  "Watch @therealjuicyj explain why he can’t say no to Ratchet #RapRadarPodcast @tidal http://tidal.com/rapradar",
  "Guess who's number 1!  @charli_xcx and @billieeilish go straight to number 1 after dropping their collab on Friday!!",
  "Tonight @Zedd has 3 #GRAMMYs nominations, including #RecordOfTheYear and Song of the Year for his track with @greymusic and @MarenMorris \"The Middle\"  Zedd has a residency at @OmniaLasVegas and is playing @KAABOOCayman and @coachella. Show info here: https://goo.gl/aHC8Mc",
  "Capitalizing on the UK underground’s rising profile, the three British MCs combine forces for a cosmopolitan, if slightly uneven, collaboration",
  "2013 was a huge year for music, lots of your favorite albums will be celebrating their 10 year anniversary soon.",
  "listener alice's olympian hinge match saga has made it to paris...but did she meet up with any of them? \n\nmore from 7am with @gregjames on @bbcsounds ",
  "Jin’s ‘Happy’ Album: Every Track Ranked",
  "This song is brilliant",
  "This piano is purrfect \n\n( Minh Piano)",
  ".@ChloeQisha – ‘Chloe Qisha’ EP review: infectious pop that’s equally slick and sensitive",
  ".@flipt0phead – ‘Up Like A Weather Balloon review: avant-garde art-rock packed with wry lyricism",
  "Name a more iconic Dua, I’ll wait",
  "Travis Scott’s caravan in Vegas\n\n“Stormi for Prez” ",
  "All the 2024 Latin Grammy Performances Ranked",
  "Ty, who has autism, brought a plush bunny to school in his backpack and then was charged with a felony after a teacher misunderstood him.",
  "After five @onedirection albums and one solo LP with Sony Music and @syco, now @Louis_Tomlinson is officially an independent artist with @BMGuk https://musicweek.com/labels/read/louis-tomlinson-signs-global-deal-with-bmg/083225…",
  ".@gorillaz are back with a new album and will play tomorrow night at a secret London location! find out more at http://gorillaz.com",
  "Jin of @bts_bighit releases his highly anticipated first solo EP, which explores his journey to find happiness. Happy is now streaming in Spatial Audio: http://apple.co/JinHappy\n#진 #Jin #Jin_Happy",
  "Throughout CONGLOMERATE, the trio foils each other in hypnotic ways",
  "Nemahsis’ debut album, ‘Verbathim’, is a collection of radically precise-pop – a self-determined statement of being by the Palestinian-Canadian artist.\n\n@nemahsis is on #NMETheCover. Read the full story: https://nme.com/the-cover/nemahsis-11-11-2024-3811422…",
  "it is a good day to be a blink 182 fan",
  "SURPRISE -- Exclusive merch is available now on our brand new SoundCloud store. \n\nRun don't walk: https://ow.ly/qvz650SWRBU",
  "Listen to @thekooksmusic and @lovelytheband’s synth driven new single ‘Jeanie’",
  "Old accounts & comments are back \n\nSign in using your old account's email address to reactivate your HotNewHipHop profile! \n\nHead over to our website to check it out! ",
  "Congrats to Bolton-born singer-songwriter Chrystal for achieving her first UK Top 40 single today with The Days  http://officialcharts.com/chart-news/gracie-abrams-thats-so-true-number-1-week-2/…",
  "Ready @NICKIMINAJ?",
  "Gracie Abrams (@gracieabrams) holds strong for a second week at Number 1 with That's So True \nhttp://officialcharts.com/chart-news/gracie-abrams-thats-so-true-number-1-week-2/…",
  "My Chemical Romance just dropped their first song since 2014, please check in on your emo friends. They are not okay.",
  "what if we…. kissed outside the emo wendys? @Wendys",
  "In a heartfelt exchange, Wallo and Gillie reminded Kodak of his worth, challenges, and the importance of being there for his kids.",
  "Watch @LarryJuneTFM speak on his perseverance. Listen & Download here: http://link.chtbl.com/hxpJRJqQ",
  "Linkin Park’s ‘From Zero’: All 11 Tracks Ranked",
  "Teddy Swims earns a third UK Top 10 single today with Bad Dreams  \n\nCongrats, @teddyswims  http://officialcharts.com/chart-news/gracie-abrams-thats-so-true-number-1-week-2/…",
  "Incredible Beethoven 'Ode to Joy' flashmob! \n\n( Banco Sabadell)",
  ".@flolikethis – ‘Access All Areas’ review: a front row seat to the next big thing",
  "I'm sorry but what?  Maybe we let somebody else have the mic. Tune into Churchy on Tuesday 10/9c for more come to Jesus moments.",
  "My Chemical Romance Announces 2025 Stadium Tour: See the Dates",
  "Spotify Stock Jumps 15%, Live Nation Shares Also Gain After Q3 Earnings",
  ".@tatemcrae catches feelings on her new single, \"2 hands.\" Listen now and pre-add her upcoming project, So Close To What: http://apple.co/2hands",
  "Drew Barrymore’s extremely up close-and-personal interview style met its match in Martha Stewart during an interview on the actress’ daytime talk show. \n\nMore: https://rollingstone.com/tv-movies/tv-movie-news/martha-stewart-pushes-drew-barrymore-1235164143/…",
  ".@flolikethis revives the legacy of iconic R&B trios with their debut album, Access All Areas. Stream it here: http://apple.co/FLOAlbum",
  ".@linkinpark solidifies their comeback with their new album, From Zero. http://apple.co/FromZero",
  "It's New Music Friday, and our girl Mary J. Blige just dropped some new music, along with Lil Baby and Wizkid!",
  "I'll never be a stranger to my love for @as1one_official \n\nCatch \"Stranger (Sunset Sound Performance) premiering allll day long on MTV Live + MTVU!",
  "Congrats @bts_bighit for winning 3 awards last night at the #AMAs  The group took home the win for Social Artist of the year, Pop/Rock Duo or Group and Tour of the Year!",
  "Addison Rae taps @arca1000000 for her \"Aquamarine\" remix. Listen to \"Aquamarine / Arcamarine\" here: http://apple.co/ARCAMARINE",
  "short n' sweet has gone straight to number 1!! congratulations @SabrinaAnnLynn !!",
  "REVIEW: Rauw Alejandro gets over a major breakup by turning to the musical roots of Latin pop\n\nMore: https://rollingstone.com/music/music-album-reviews/rauw-alejandro-cosa-nuestra-review-1235166219/…",
  "TrapMoneyBiggie is one of the hottest producers in DMV street rap and he’s from Rotterdam, in the Netherlands",
  "Elmo Has an Awkwardly Funny ‘Chicken Shop’ Playdate With Amelia Dimoldenberg",
  "Last night, 39-year-old composer Ludwig Göransson won his second Academy Award for his score to ‘Oppenheimer’. In a heartfelt speech, he thanked his parents for giving him his foundation in music.",
  "Lil Baby at the shooting range, how’s he looking?",
  "RAPRADAR: DaBaby Ft. Davido “Showing Off Her Body” https://ift.tt/YEzm3VW",
  ".@JonBatiste breaks musical barriers, reimagining classical hits in the context of blues. Listen to Beethoven Blues now: http://apple.co/NewJonB",
  "Tori Kelly’s performance of the national anthem at the Jake Paul vs. Mike Tyson fight",
  "Johann Sebastian Bach died on this day in 1750.",
  ".@FKAtwigs delivers the third offering off of her upcoming album, EUSEXUA. Listen to \"Drums of Death\" now: http://apple.co/DrumsOfDeath",
  "Welcome to the Music Week cover Mr @Harry_Styles",
  ".@U2’s The Edge says their new album is “not a straight up rock thing”\n\n\"I think it’s going to be a very different kind of use of the guitar\"",
  "EXCLUSIVE ALERT - Tap in now to hear new drops from #Osamason, #RickyBravo and more    https://ow.ly/ALKy50SmOyl",
  "The coronation classic that everyone is talking about... \n\nHandel’s ‘Zadok the Priest’ in a supermarket flashmob.",
  "Watch Will Smith speak on 'The Fresh Prince of Bel Air' deadbeat dad scene @tidal #rapradarpodcast http://tidal.com/rapradar",
  "Who's excited to see .@Anitta kill it again at #Coachella this weekend? #Anitta",
  "More amazing Black News!",
  "Arca’s dembow-lite remix of Addison Rae’s latest single deserves to be a lot weirder than it is",
  " Wonder (2020)",
  ".@johnsummit shares how he uses his social media influence in the EDM community. \n\nWatch more from his panel at #BillboardLiveMusicSummit: http://blbrd.cm/wpc8xSz",
  "1. Watch out\n2. Don’t cry\n3. Don’t pout\nI’ve got Yule rules I count ‘em",
  "A defining cultural artifact of the dark, trashy, celebrity-driven essence of the aughts",
  "Week after week, we're peeling back the curtain on some of our favorite artist's creative journeys and songwriting processes. Catch up on Voice Notes now: https://ow.ly/Tjhb50U8jM2",
  "Watch @CurrenSy_Spitta talk mixtape & influence. #rapradarpodcast @tidal http://tidal.com/rapradar",
  ".@taylorswift13 hails fans at Toronto show over Grammy nominations: “It’s so unbelievable, thank you”",
  "Gillie delivers heartfelt message following the passing of Takeoff, calling out bystanders for recording the tragic event and blog sites for reporting on the passing for clicks: “[Takeoff] just lost his life and you n***as is trying to get likes.”",
  "We hung out with @whydontwemusic at our NYC HQ for an intimate acoustic performance  Head this way to check out their performance of #8Letters and learn more about what's next for the band: http://bit.ly/2JQ1NW2",
  ".@ShawnMendes releases his vulnerable self-titled album, Shawn. Hear it now:\nhttp://apple.co/Shawn",
  "Louis Tomlinson Is Done Playing It Safe. @Louis_Tomlinson \n\nRead the digital cover story now. \n\n:  @lanikaps\n: Edward Cooke\n\nhttps://altpress.com/louis-tomlinson-faith-in-the-future-interview/…",
  "Lucy, a young blind pianist who stunned on 'The Piano' earlier this year, performs a note-perfect rendition of Bach's Prelude in C at the Coronation Concert. ",
  ". @BTS_twt celebrate a third victory in IFPI global chart awards following \"unprecedented\" sales success around the world\nhttps://musicweek.com/news/read/bts-celebrate-triple-victory-in-ifpi-global-chart-awards-and-unprecedented-sales-success-in-2020/082806… #BTS #IFPIGlobalAlbumSalesChart",
  "Aldis Hodge on taking on the role of Alex Cross in #Cross: \n\n\"It’s a nuanced take on the idea of a thriller that I’ve been waiting on for a long time, done in a really creative, avant-garde way...\" \n\nMore: https://rollingstone.com/tv-movies/tv-movie-features/aldis-hodge-alex-cross-interview-1235155384/…",
  "When a trumpeter happened upon a stairwell with an amazing acoustic he knew what he had to do...",
  "Lil Durk has pleaded not guilty to murder-for-hire charges",
  "This weeks #TrendingArtist is #EXO_CBX - the first official sub-unit of South Korean-Chinese boy group #EXO. The group has been dominating our trending charts since they first appeared on them in the middle of March.",
  "Watch Gifted to John Lennon Months Before Death Belongs to Yoko Ono, Court Rules\n\nMore: https://rollingstone.com/music/music-news/john-lennon-yoko-ono-missing-watch-patek-philippe-1235167187/…",
  "Now on the #rapradarpodcast its: #JAYZ http://tidal.com/onair",
  "Avoiding crashing out by tuning into #FEMCEES",
  "During tonight's fight, Mike Tyson plans on wearing boxers dedicated to his daughter he lost in 2009.",
  "5 Seconds of Summer (@5SOS)  join @Louis_Tomlinson at independent label @BMG https://musicweek.com/labels/read/5-seconds-of-summer-sign-to-bmg/084307…",
  " WIN TICKETS TO READING AND LEEDS \n\nyou could win tickets to @OfficialRandL all week from 12th august\n\nlisten to radio 1 breakfast with @gregjames for your chance to win  full t&cs at https://bbc.in/3Ak2jc2",
  "Fingerpicked guitar casts a dream-like trance around Khari Lucas’ plaintive singing on a spare, dense album with the quiet fervor of prayer",
  "Christmas is coming  Have you seen the newest @JohnLewisRetail ad?   ",
  ".@lukebryan & Peyton Manning on How New Hulu Series ‘It’s All Country’ Became ‘So Much More’ Than They’d Envisioned",
  "RAPRADAR: Chris Brown Ft. WizKid “Call Me Everyday” https://ift.tt/EUN2tmX",
  "here's august's resident DJ NIKS with her three track IDs \n\nlisten every thursday this month from 11pm on @bbcsounds ",
  "You’re not going to want to miss ComplexCon \n@MetroBoomin joins the Saturday lineup alongside @playboicarti & Opium. And on Sunday, @trvisXX & Cactus Jack.\n\nGet tickets here : http://bit.ly/3WIeRBM",
  "You @5SOS fans are all about that @tumblr! Congrats on winning #APMAs Tumblr. Fandom of the Year! #thisisCLE",
  "Thanks to @PetcoPark, home of the San Diego @Padres, for sponsoring this year’s #BillboardLiveMusicSummit. ",
  "Instead of getting a BBL, SZA now wishes she should have focused on her mental health first.",
  "IT'S LISA'S WORLD  Channeling her star power into a solo career, LISA is pioneering a new model for success: “Call me Boss Lisa.”\n\nBillboard's first-ever global cover star tells all, gracing 10 covers representing regions across the globe: http://blbrd.cm/79WWgpl",
  "Wishing a VERY happy #NewMusicFriday to those who celebrate – Tell me which release YOU have stuck on repeat \n 'Shawn' (ALBUM) by @ShawnMendes\n \"2 hands\" by @tatemcrae\n 'Access All Areas' (ALBUM) by @flolikethis\n 'GOLDEN HOUR: Part.2' (EP) by @ATEEZofficial",
  "A HUGE congrats for @falloutboy and @BTS_twt!  https://altpress.com/news/entry/fall_out_boy_bts_champion_remix_rock_chart_history…",
  ".@bjork’s new Paris @CentrePompidou sound exhibition will “recreate” extinct animal calls\n\n\"In the veins of the escalator of the museum, known as the “caterpillar,” we wanted to remind citizens of the raw vitality of endangered creatures\""
]