[
  "",
  "We're all fucked\n\nvia: @oatsstudios",
  "After raising nearly half a billion dollars, ABL Space pivots from launch vehicles to missiles",
  "BREAKING: Jake Paul (age 27) has just challenged Mitch McConnell (age 82) to a boxing match in 2029",
  "25 years of phone sales, in 15 seconds \n⁣\n(Made with Flourish )",
  "WhatsApp now lets you save message drafts",
  "Microsoft's new app brings Windows to Chromebooks, Macs - for select users",
  "Doctor Who Is Here to Inject Some Early Christmas Cheer Into Your Friday",
  "Bluesky says it won’t train AI on your posts",
  "A lot of people are mistaking Elon Musk’s Starlink satellites for UAPs",
  "Apple Pay 'Plates' ad shows how easy it is to spend money on the internet https://9to5mac.com/2024/11/15/apple-pay-plates-ad-shows-how-easy-it-is-to-spend-money-on-the-internet/… by @apollozac",
  "Musk’s Twitter is getting worse",
  "First Small Modular Nuclear Reactor Certified For Use In US",
  "PUBG will return to India with a new game…PUBG Mobile India (story by @Indianidle) https://tnw.to/YrKmD",
  "I miss you ",
  "Robert Bosch Venture Capital bets on IOTA as it invests in the future of IoT https://wp.me/p8wLEc-9FEZ by @TheRealSJR",
  "How Half-Life 2 helped sell Steam to a skeptical PC gaming market",
  "iPhone XS Max and more join Apple’s vintage and obsolete product lists https://9to5mac.com/2024/11/15/iphone-xs-max-and-more-join-apples-vintage-and-obsolete-product-lists/… by @iryantldr",
  "‘AI Granny’ is happy to talk with phone scammers all day",
  "The best gift for the reader in your life ",
  "ChatGPT’s success could have come sooner, says former Google AI researcher",
  "‘AI granny’ scambaiter wastes telephone fraudsters’ time with boring chat",
  "Internet from Space is on its way, thanks to @ElonMusk and @SpaceX.",
  "We're giving away a Nexus 5X! To enter, Follow us here on Twitter, and RT this post. More at http://phon.es/n5xcontest",
  "iOS 18.1: How to Type to Siri https://macrumors.com/how-to/ios-type-to-siri/…",
  "AI poisoning tool Nightshade received 250,000 downloads in 5 days: 'beyond anything we imagined'",
  "The BTS ARMY pulled off the ultimate flex — ignoring the VMAs completely.",
  "Apple Adds iPhone XS Max and More to Vintage/Obsolete Product Lists https://macrumors.com/2024/11/15/apple-adds-two-iphone-models-to-vintage-list/…",
  "This is how @Tesla's are made.",
  "Apple secretly included quantum dot tech in the M4 MacBook Pro's display",
  "The crypto industry is really tired of things like laws and rules.",
  "Facebook's logo makes so much sense now ",
  "WhatsApp finally has a drafts feature",
  "It's time to give away a new Samsung Galaxy S6 edge+! RT this to enter! Full rules at http://phon.es/edgepluscontest",
  "EU fines Meta €800 million for breaking law with Marketplace",
  "The suddenly hot Bluesky says it won’t train AI on your posts",
  "Report corroborates on Samsung making Galaxy S25 ‘Slim’ to compete with iPhone Air",
  "Amazon Fire HD 8 (2024) review: A cheap tablet hampered by outdated software",
  "The best early Black Friday storage and SSD deals",
  "Here’s the full list of 44 US AI startups that have raised $100M or more in 2024",
  "Mortal Kombat 11 trailers reveal Baraka, Geras, and Ronda Rousey",
  "We talked with OnePlus CEO Pete Lau ahead of the launch of the company's affordable TVs in India",
  "Microsoft makes it easier to do a clean Windows install on Arm-based PCs",
  "US government finalizes TSMC's $6.6 billion CHIPS Act incentives",
  "EXCLUSIVE: @RobertDowneyJr, @AnthonyMackie & the #CaptainAmericaCivilWar cast join @ChrisEvans for a battle hymn.",
  "Weather widget added to Sequoia earlier this month \n\nSystem Settings > Control Center > Weather > Show in Menu Bar",
  "Cybertruck doing test drives in the Tesla lot #Tesla #TeslaPickupTruck #TeslaCybertruck #Cybertruck",
  "VW Announces $20 Billion Effort To Build Its Own EV Batteries",
  "Keep Nuclear Power Plant Open, Urge 79 Scientists, Academics and Entrepreneurs",
  "How much lighter is the titanium iPhone 16 Pro vs steel iPhones?",
  "Half-Life 2 is getting a huge 20th anniversary update",
  "Pornhub is handing out free premium subscriptions to help Italy fight coronavirus (by @Mixtatiq) https://tnw.to/z5ZwD",
  ".@elonmusk and @Tesla just released their fully autonomous driving feature!",
  "The most popular social media networks each year, gloriously animated\n\nRead the whole story here: http://tnw.me/mFpFnxq",
  "The Oura smart ring is on sale for Black Friday (and that never happens)",
  "K-pop group #BTS just broke another world record http://on.mash.to/2zvlXSo",
  "From sitting in on calls with foreign leaders to recommending new hires, Musk is already wielding power at Donald Trump’s side.",
  "X will begin to have users verify their identity by having them submit a selfie alongside a government issued ID. The process requires users to consent to X storing their information for 30 days and sharing it with AU10TIX, an identity verification company based in Israel.",
  "Former TuSimple co-founder urges courts to block asset transfer to China",
  "This spoon stays level no matter how you move it!",
  ".@FloydMayweather announces Manny Pacquiao fight via selfie app @Shots http://on.recode.net/1AVGPN7 via @KurtWagner8",
  "Unlike X, Bluesky says it won’t train AI on your posts",
  "Oppo's new flagship phone has a shutter button similar to one Apple debuted with the iPhone 16 series",
  "This K-pop band just beat Justin Bieber and Selena Gomez at the Billboards http://on.mash.to/2q8m2Tc",
  "During the #AppleEvent, we'll probably see a MacBook Pro with Apple's new M1X chip.",
  "Stop using your phone number to log in",
  "Review: Amazon’s 2024 Kindle Paperwhite makes the best e-reader a little better",
  "Japanese Court Ruling Poised To Make Big Tech Open Up on Algorithms",
  "Mike Tyson is set to go head-to-head with Jake Paul, here's how you can watch #PaulTyson ",
  "Show us your lock screen and home screen photos.",
  "The first lady of Japan may have pretended not to speak English to avoid Trump http://on.mash.to/2uMHseB",
  "With just a few days to go before the OnePlus 8 unveiling, let's take a look back at how @OnePlus phones have changed and evolved over the years ",
  "ESPN is testing a generative AI avatar called ‘FACTS’",
  "Hands-On With Apple's New Final Cut Pro 11 Update https://macrumors.com/2024/11/15/final-cut-pro-11-hands-on/…",
  "\"The economy is not sending any signals that we need to be in a hurry to lower rates,\" Chair Powell said, calling the US economy's recent performance \"by far the best of any major economy in the world.\"",
  "Adobe Flash support officially ends today.",
  "Are standing desks good for you? The answer is getting a clearer.",
  ".@ElonMusk's rocket looks so cool, it's like something from Dragon Ball Z  #SoundOn",
  "Moon Girl and Devil Dinosaur Episode Allegedly Scrubbed Over Trans Storyline",
  "PornHub's traffic dipped significantly the day Fallout 4 came out http://wp.me/p5hvhT-7IlY by @jeffgrubb",
  "Twitter really is the most interesting social media platform.",
  "Why camp by a river when you can camp on one? https://x.com/mashable/status/1162730046882308096/video/1…",
  "Mickey Mouse Could Soon Leave Disney As 95-Year Copyright Expiry Nears",
  "Having neck pain? We found the best pillow for neck pain and it's only $40.",
  "Up your home espresso-making game with these WIRED-tested foam makers.",
  "Netmarble invests $190 million in K-pop sensation BTS's music label https://wp.me/p8wLEc-9ONv by @sweijuchan",
  "The 15 best early Best Buy Black Friday 2023 deals",
  "Best Buy Introduces Early Black Friday Discounts on M4 iPad Pro, Get Up to $150 Off https://macrumors.com/2024/11/15/m4-ipad-pro-gets-discounts/…",
  "The cost of electricity is constantly fluctuating but knowing what time of day to power up your appliances can save you money.",
  "Elon Musk adds Microsoft as defendant in his lawsuit against OpenAI",
  "I played Half-Life 2 for the first time this year—here’s how it went",
  "Trump team puts EV tax credit on the block, Tesla is on board: Report",
  "Scientists Claim They've Reversed Aging in Mice",
  "Someone Leaked Classified Chinese Tank Schematics To Win an Online Argument",
  "Disney Has Shifted an Untitled Star Wars Movie Off Its Upcoming Schedule",
  ".@DrLupo is really excited about this next big event for charity.",
  "GM's Cruise will pay a $500,000 fine for submitting a false accident report",
  "Here’s how much thinner Apple Watch Series 10 is compared to Series 9 and earlier",
  "Will @VancityReynolds's 'deepfake treatment' ignite a remake to Willy Wonka?",
  "AI is outperforming our best weather forecasting tech, thanks to DeepMind",
  "Mark Zuckerberg on leaked audio: Trump’s looting and shooting reference “has no history of being read as a dog whistle” https://bit.ly/3cr3bKj",
  "Tech critics are more sophisticated than ever. They’re still wrong.",
  "Tesla delivers 24,500 vehicles in Q3, a 111% annual increase https://wp.me/p5hvhT-8GuY by @thekenyeung",
  "Added in macOS 15.2's second developer beta, but now available in the latest public beta",
  "Why is SBF being reported on so gingerly?",
  "Facebook is changing its primary metric to ‘views’",
  "The 70 best early Black Friday Walmart deals you can buy now",
  "Senator to Valve: what’s with all the Nazis on Steam?",
  "So you want to be a programmer, huh? Here are 25 ways to learn online http://tnw.to/o5wJ by @chadcat",
  "‘I went to Greenland to try to buy it’: Meet the founder who wants to re-create Mars on Earth",
  "ADL’s report on racist Steam Community posts prompts a letter from Virginia senator",
  "OpenAI accused of trying to profit off AI model inspection in court",
  "NSO Group admits cutting off 10 customers because they abused its Pegasus spyware, say unsealed court documents",
  ".@ElonMusk always delivers. @Tesla's electric semi truck makes its maiden voyage.",
  "Best Apple Deals of the Week: Early Black Friday Prices Arrive for Apple Watch Series 10, MacBook Air, and More https://macrumors.com/2024/11/15/best-apple-deals-of-the-week-11-15-24/…",
  "Archaeologists Use Spy Satellite Images to Spot Location of Famous Ancient Battle",
  "Numbers don't lie",
  "How @fucktyler plans to ditch Tumblr. The full #codemedia interview: http://on.recode.net/1GCRmLQ @pkafka",
  "Last Call for today’s deals: All-time lows hit new M4 MacBook Pro, 16GB M3 MacBook Air, MagSafe 3 charging cable, M2 iPad Air, more",
  "Comcast: Pandemic drove peak internet traffic up 32% in 2020",
  "Want to digitally control your favorite instruments? These tools will help.",
  "The 901s are back! Sort of.",
  "Elon Musk targets Microsoft in amended OpenAI lawsuit",
  "Disney has reportedly pulled a Moon Girl and Devil Dinosaur episode for telling a trans-inclusive story",
  "The Morning After: Our verdict on Apple’s M4 iMac",
  "How to create a gradient transparency in GIMP",
  "How Riot Games wants to ensure that Valorant's esports stars include women https://wp.me/p8wLEc-bhDz by @deantak",
  "Ask Slashdot: Have AI Coding Tools Killed the Joy of Programming?",
  "From dog beds to pup backpacks, we’ve had our furry best friends try it all. These dog accessories lead the pack.",
  "InnerSloth, the studio behind the hit online multiplayer game, #AmongUs 1 is canceling the recently announced sequel to focus more on the original.",
  "Engadget Podcast: Bluesky’s big moment",
  "For every job AI eliminates, 3 new AI hype thread creator jobs are born.",
  "The 10 best early Black Friday Kindle deals",
  "FTC to launch investigation into Microsoft’s cloud business",
  "Casio’s first smart ring has innovative features like a stopwatch and flashing alarm",
  "Social media used to be free. Not anymore.",
  "A class action lawsuit against Apple has been filed for them continuing to sell AirPods Pro models that have issues with crackling or static sounds. Have you been affected?",
  "Spain Plans To Invest $12.4 Billion in Chips, Semiconductors",
  "And here’s some completely unrelated information:",
  "NASA is partnering with Microsoft to develop an AI-powered chatbot geared toward making it much easier to sift through the enormous amounts of data collected by the space agency's Earth-observing satellites",
  "X sues California over deceptive AI-made election content ban",
  "PBS Kids, local PBS stations and two new FAST channels are hitting the Amazon streamer.",
  "Learn Python for just $24 with this course bundle",
  "The best early Black Friday VPN deals 2023",
  "If there’s one thing you need to see today, it’s this human vs. dog noodle eating competition https://x.com/jbillinson/status/1155610305063456768/video/1…",
  "Netflix Shares Crater 20% After Company Reports it Lost Subscribers For the First Time in More Than 10 Years",
  "Faulty Colorsofts have left some Kindle owners without an e-reader",
  "The US IPO window hasn’t reopened yet, but startups take what they can",
  "Someone's going to try and sell an iPhone with Flappy Bird, Fortnite and TikTok on eBay for $10,000 next week.",
  "Saga's Brian K. Vaughan Is Reviving Sci-Fi Classic Forbidden Planet",
  "BTS World: Pre-registration starts for K-pop group's mobile game https://wp.me/p8wLEc-asn5 by @deantak",
  "TikTok isn’t really limiting kids’ time on its app",
  "Cruise fined $500k for submitting a false report after last year’s pedestrian crash",
  "Here's how to use those new, diverse emoji in iOS 8.3 and OS X 10.10 http://tnw.co/1CxKrPr https://pic.x.com/qiwnVJV3cb",
  "The M4 MacBook Pro features a quantum dot display",
  "ChatGPT in iOS 18.2: Here’s what Apple Intelligence has coming next https://9to5mac.com/chatgpt-in-ios-18-2-heres-what-apple-intelligence-has-coming-next/… by @iryantldr",
  "Our favorite tech of 2024: See all the gadgets that won Gizmodo's Best of 2024 Awards",
  "It’s time to give away a #GalaxyNote5! Follow us and RT this to enter! More (and rules) at: http://phon.es/note5contest",
  "When Xbox Live is down and you realize your console's not broken",
  "Former BioWare executive producer Mark Darrah has returned to work on Dragon Age: Dreadwolf as a consultant. The Mass Effect team will help ship the game.",
  "YouTube tech reviewer Marques Brownlee (@MKBHD) is the most famous person you wouldn’t recognize in public https://recode.net/2018/4/12/17223290/marques-brownlee-mkbhd-youtube-tech-video-reviews-recode-media-peter-kafka-podcast?utm_campaign=recode.net&utm_content=chorus&utm_medium=social&utm_source=twitter…",
  "I, too, installed an open source garage door opener, and am loving it",
  "PC gamers reading about the Epic Games - Apple lawsuit:",
  "GameStop launches NFT marketplace on Immutable X, creates $100M dev fund",
  "Citing “decreasing” launch opportunities, ABL Space will pivot to missile defense",
  "Comcast commits $3.5 million to digital equity causes https://wp.me/p8wLEc-bbMd by @deantak",
  "Reporters Without Borders says it’s pressing charges against X",
  "Dorsey says Twitter is thinking about an edit button to fix typos in tweets http://tnw.me/Vwx8Lv3",
  "9 questions about the threats to ban TikTok, answered",
  "#Blackpink's Lisa on the #GalaxyS10\nhttps://digitaltrends.com/digital-trends-live/episode-69/…",
  "Meta is testing custom feeds for Threads",
  "Japan PM Says Country On the Brink Over Falling Birth Rate",
  "Best early Black Friday deals on products ZDNET's tested and recommend",
  "Apple Highlights Apple Pay in New 'Plates' Ad https://macrumors.com/2024/11/15/apple-pay-ad-plates/…",
  "iPhone's Satellite Feature Launched Two Years Ago Today, Remains Free https://macrumors.com/2024/11/15/iphone-satellite-feature-turns-two/…",
  ".@Pornhub is giving Italians free premium access during coronavirus quarantine: https://trib.al/5QzbHfo",
  "The @MacRumorsShow: Major Updates for Apple's Pro Apps https://macrumors.com/2024/11/15/the-macrumors-show-apple-pro-apps-updates/…",
  "You may be able to deduct your internet expenses come tax season. See what it takes to qualify for compensation on your internet bill ",
  "Three technologists in India used a homemade Faraday cage and a microwave oven to get around Apple’s location blocks.",
  "Zebra mussels, hydrilla, and now a water flea have made their homes in New Croton Reservoir.",
  "What is Bluesky? Everything to know about the X competitor",
  "Reuters Reports $1B of Client Funds Missing at FTX",
  "Founder of China's battery giant was blunt in his assessment, saying unequivocably that Elon Musk \"is going to fail.\"",
  "Gen Z's Financial Independence Comes From Social Media, Not Traditional Work",
  "Facebook is secretly using your iPhone’s camera as you scroll your feed https://tnw.to/u08wG",
  "WeChat Rolls Out Passkey Support for iOS Users Outside China https://macrumors.com/2024/11/15/wechat-rolls-out-passkey-support-ios-outside-china/…",
  "Lowered age restrictions and cheaper VR headsets have led to young kids hijacking the metaverse. Maybe we should let them keep it.",
  "InfoWars is back amid a lot of confusion",
  "What to expect: deregulation justified as boosts for the economy, and platitudes about the importance of clean air and water.",
  "The ISS Is Leaking Air—And NASA and Russia Can’t Agree Why",
  "Hide iPhone Find My Location Without Raising Suspicion https://macrumors.com/how-to/hide-your-iphone-find-my-location/…",
  "We’ve been into #ios14homescreen since 2010, just saying",
  "2025 TNW Conference Theme drop in 3..2..1 \n\nThis year we have 6 refreshed themes that are bound to target your business needs and give you actionable solutions. Get ready for game-changing conversations and connections that'll leave you buzzing.\n\nRead more ",
  "The exciting new AI transforming search — and maybe everything — explained",
  "NordVPN Starts Black Friday Early: The VPN Is 74% Off (+ 3 Extra Months)",
  "Elon Musk deletes SpaceX and Tesla Facebook pages, axing more than 5 million followers https://wp.me/p8wLEc-9NLV by @kharijohnson",
  "We’re saying goodbye to the Recode branding today, but you can still find all the same great work from the reporters you know and love, plus an expanded focus on tech and innovation, over at http://vox.com/technology.",
  "Hey Twitter. \n\nWhat phone are you using right now? ",
  "The new Mac Mini is great — now do the iPhone SE",
  "South Korean pop star and #BTS member Jung Kook found out about TikTok’s privacy settings the hard way. Here's how to lock down your TikTok account to avoid making the same mistake.",
  "Heads up! Apple Watch Series 10 is scheduled to be $100 off this Sunday (best price ever), here's what you need to know https://9to5toys.com/2024/11/15/best-black-friday-apple-watch-series-10-deals/… by @justinkahnmusic",
  "This guy built a prosthetic using Legos.",
  "Russian government forces Apple to remove more independent news apps https://9to5mac.com/2024/11/15/app-store-russia/… by @apollozac",
  "From KAIST Exoskeleton Laboratory and Angel Robotics, the WalkON Suit F1 is a “powered exoskeleton” designed to walk on its own, and allows for users to easily transfer into the suit from a wheelchair.",
  "Zoox is rolling out its self-driving vehicles in Las Vegas and San Francisco. Technology Reporter @alheeti_3 got a sneak peek at what's coming.",
  "Teen who voices 'Dora the Explorer' suspended for vaping in school: http://on.mash.to/1S4gM9C",
  "Apple Vision Pro weekend viewing: 'currents' on Vimeo https://9to5mac.com/2024/11/15/apple-vision-pro-currents-vimeo/… by @apollozac",
  "Get Microsoft Office for as low as $50 for Mac and PC now",
  "OpenAI at one point considered acquiring AI chip startup Cerebras",
  "YouTube CEO Susan Wojcicki is stepping down",
  "Samsung's newest S20+ edition aims to recruit the BTS A.R.M.Y",
  "'Leaked' Nintendo NX controller is driving gamers crazy http://tnw.me/XQmRtXL",
  "Why camp by a river when you can camp on one?",
  "\"Yep, here's your problem. Someone set this thing to 'No Bluetooth.'\"",
  "Man Who Received Historic Pig Kidney Transplant Did Not Die From It",
  "For Sale, Barely Used: One Actual-Size Dan Da Dan Magic Testicle",
  "If you're a Cash App user, you might be eligible for a share of the $15 million settlement -- but you have to submit your claim form by Nov. 18.",
  "Tapbacks are better in iOS 18’s Messages app, but they need one key fix https://9to5mac.com/2024/11/15/tapbacks-are-better-in-ios-18s-messages-app-but-they-need-one-key-fix/… by @iryantldr",
  "John Legend is the youngest ever to achieve EGOT status #Emmys https://trib.al/e9aRqdi",
  "Russia Launched Ukraine Invasion With Hack of Thousands of Satellite Modems",
  "\"The Swifties were the canaries in the coal mine.\"",
  "Justin Bieber breaks major Spotify record with 'What Do You Mean?': http://on.mash.to/1Kue0fx",
  "Two early Unreal games are now permanently free via the Internet Archive",
  "When you need something that's as unnecessarily masculinized as you can get for the Man™ in your life, we have you covered.",
  "Epic Says Google Paid Activision Millions Not To Launch Rival App Store",
  "18 states want the SEC to stop enforcing crypto regulation",
  "South Korean boy band BTS just absolutely slayed the #AMAs. We are done. http://on.mash.to/2jDEaFX",
  "After a Montana man illegally cloned and bred an endangered giant sheep species, government agencies must now contend with the illicit offspring.",
  "Hmm",
  "Payments, public & private clouds: What you definitely need to know (Sponsored)",
  "Apple Intelligence Image Wand: All the New Features in iOS 18.2 https://macrumors.com/guide/image-wand/…",
  "Sounds tattoos are now a thing and TBH it's pretty dope.",
  "Ye gods, my Skype is ruined! But what if I were to purchase Discord and disguise it as my own cooking?",
  "The Ultimate Firewall ",
  "Hey everyone! @Linux turns 27 today. Happy birthday, Linux!",
  "Trump's transition team reportedly has the EV tax credit, which awards up to $7,500 in tax credits to purchasers of EVs, in its crosshairs as part of its tax reform plan.",
  "OpenAI’s tumultuous early years revealed in emails from Musk, Altman, and others",
  "Google will let you make AI clip art for your documents",
  "It comes as a surprise to few, but the @oneplus 3T is an incredible phone at any price! #BestAC",
  "In one of the first good plot twists of 2020, the #ProudBoys hashtag has become a thing of beauty.",
  "Did PayPal Just Reintroduce Its $2,500 'Misinformation' Fine, Hoping We Wouldn't Notice?",
  "Two recent studies offer some of the most nuanced evidence yet about the potential benefits and risks of working on your feet. via @arstechnica",
  "The best early Black Friday iPad deals 2023",
  "Section 230, the internet law the Supreme Court could change, explained",
  "How to use ChatGPT to make charts and tables"
]