[
  "Following a record-breaking 2019, K-Pop band @BTS_twt reached new heights with their first English-language song ‘Dynamite’ on the U.S. Billboard charts. But they wish they could celebrate with their fans https://reut.rs/2RpeCtL",
  "Congratulations to our White House correspondent @Yamiche for receiving the 2020 NABJ Journalist of the Year award. https://to.pbs.org/2JdtBWW",
  "#ICYMI: These school kids managed to recreate #Daraprim's active ingredient for just $20",
  ".@AOC nominates Senator Bernie Sanders for president of the United States 'out of the love for all people' https://reut.rs/3g6aHfk",
  "The actress who boarded the flight with head lice has continued to double down on her actions.",
  "Dr. Fauci says Americans will likely need to stay home for at least several more weeks: “I cannot see that all of a sudden, next week or two weeks from now it's going to be over. I don't think there's a chance of that.\"",
  "Madrid has become the first major European city to reverse a ban on high-emissions vehicles and allow cars unfettered access to an area that was placed out of bounds for many less than a year ago",
  "Mexicans who served in US Army with the promise of becoming citizens but ended up being deported, protest on Memorial Day in Ciudad Juarez",
  "Comparison: President Trump and Barack Obama’s #Inauguration  crowds #DayOne http://to.pbs.org/2jxkS15",
  "Senior Trump adviser suggests Rudd’s time as US ambassador could be up with hourglass gif",
  "Men from overseas, including Australia, are estimated to have fathered tens of thousands of children to sex workers in the Philippines.\n\nNow, thanks to DNA, the children are tracking them down.\n\nWatch the #4Corners documentary, Sex Tourism: My Father’s Secret, on ABC iview:",
  "A dictator and his beauty queen wife amassed nearly $13b in stolen wealth. Now their son is set to rule",
  "Israel said Palestinian militants had misfired projectiles, but an analysis of photos and videos of Friday’s strikes shows that some of the munitions were likely fired by Israeli forces.",
  "Trump’s victory has fractured the western order – leaving Brexit Britain badly exposed | Rafael Behr",
  "Elon Musk adds Microsoft to lawsuit against ChatGPT-maker OpenAI",
  "The new head of the National Economic Council or the Treasury Department could be another Fox host recruit.",
  "\"I haven’t had a boss in 25 years and I’m not about ready to start.”",
  "US election updates: Trump picks hardliner as ambassador to Israel in slew of job appointments",
  "Over the past few years, China has helped African countries build infrastructure and cultivate talents. But in the eyes of Western media, China is now colonizing Africa and the African countries are falling into China's “debt trap”. What’s the truth? #WesternMediaDebunked",
  "Watch SA Premier @JayWeatherill shirtfront Federal Energy Minister @JoshFrydenberg on live TV, after gatecrashing the presser #auspol",
  " LIVE: hearing with  Roxana Mînzatu, the proposed executive vice-president for people, skills and preparedness",
  "Federal government overestimating immigration impact on housing gap: PBO",
  " LIVE: hearing with  Teresa Ribera, the proposed executive vice-president for clean, just and competitive transition",
  "The Florida Democrat did not mince words when she described the \"irresponsibility\" of Trump's cabinet decisions, including Gabbard as director of national intelligence.",
  "This is what it looks like when you get mobbed by celebrating Croatian players #WorldCup\n @YuriYurisky",
  "This dog's mother instinct knows no boundaries when it comes to saving her puppies after house collapse",
  "Fight against #coronavirus in #China",
  "A death row inmate convicted of killing her toddler daughter is “actually innocent” of murder and should be freed from custody, the prisoner's trial judge said in documents unearthed on Thursday.",
  "We are devastated to learn of the death of AFP video journalist Arman Soldin in eastern Ukraine today. \n\nAll of our thoughts go out to his family and loved ones.",
  "This #KungFu master is faster than gravity!",
  "South Korea's soccer player Son Heung-min returned home to a rousing welcome after the Tottenham Hotspur forward ended the season as the Premier League's joint top scorer with Mohamed Salah",
  "Judge Alexandre de Moraes, a member of Brazil’s Supreme Court, has used the court’s power to counter the antidemocratic stances of President Jair Bolsonaro and his supporters.",
  "Wearing a military beret and a Polish wartime resistance armband, 94-year-old Wanda Traczyk-Stawska stunned the crowd at a pro-EU rally when she thundered \"Be quiet, stupid boy! You lousy bastard\" at a member of a far-right group http://u.afp.com/wJH2",
  "Twitter employee uses last day at work to deactivate US President Donald Trump's account http://ab.co/2z9HZql",
  "German Chancellor Olaf Scholz spoke with Russian President Putin, the Kremlin leader’s first publicly announced conversation with the sitting head of a major Western power in nearly two years, and urged Putin to be open to negotiations with Ukraine.",
  "Pfizer and BioNTech say their COVID-19 vaccine is more than 90% effective https://reut.rs/3eDWrvv",
  "Speaker Mike Johnson says he will request the House Ethics Committee not release a report on allegations related to Trump attorney general pick Matt Gaetz",
  "Frustration grows at fossil fuel influence and structure of UN climate talks. Some call for reform",
  "Athletes from five universities file a Title IX lawsuit following reports that a player on the San Jose State University women's volleyball team is transgender.",
  "Pete Hegseth, President-elect Trump’s pick for secretary of defense, was investigated in 2017 for \"an alleged sexual assault\" at a California hotel that was hosting a gathering of Republican women, Monterey police say.",
  "Pro-Russia bill triggers protests in Georgia breakaway region",
  "Fact-checking RFK Jr's views on health policy",
  "\"I let my emotions get the best of me.”",
  "From EU-US relations to the floods in Spain, find out what MEPs will be working on during this week's plenary session: https://europa.eu/!fV8rCN",
  "The decision of three actors in the Sydney Theatre Company's new production of The Seagull to wear the keffiyeh during curtain call sparked a frenzy of condemnation from members of the Jewish community. @latingle spoke to @louiseadler. #abc730",
  "Poland's PM has confirmed that \"the Polish border is open for all Ukrainians, even those without a valid ID document.\"\n\nHe has even said that they are 'welcome to bring their pets with them'.\n\nhttps://trib.al/QTC8as2\n Sky 501, Virgin 602, Freeview 233 and YouTube",
  "Pope Francis presides over a moment of prayer in the middle of an empty St. Peter’s Square. \n\n(Photos: Yara Nardi/AFP)",
  "Peter Mandelson’s consultancy advised Shein until early 2024",
  "A new species of monkey, Trachypithecus popa, has been discovered by scientists in Myanmar. Secluding themselves in the wild, they have white circles around their eyes and their fur is a trendy ‘granny grey’.",
  "Dog guards fire-ruined home for a month while waiting for owner (pic: AP)  https://ab.co/2QOk9vD",
  "Bill McRaven, retired U.S. Navy admiral who oversaw operation that killed Osama bin Laden, writes that he would “consider it an honor” for President Trump to also revoke his security clearance in solidarity with John Brennan. https://trib.al/bZv7y40 - @washingtonpost",
  "REVIEW | You are not prepared for what happens when a film answers the question, “What if Frosty the Snowman was a total babe?”",
  "Imran Khan, the former prime minister of Pakistan, was wounded at a rally on Thursday after at least one unidentified man opened fire on his convoy, in what his aides called a targeted attack. https://nyti.ms/3sXfV6a",
  "WATCH: \"I am a man with Down syndrome and my life is worth living\" said Down syndrome advocate Frank Stephens to lawmakers on Capitol Hill.",
  "Husband of a woman who died in the Kobe Bryant helicopter crash says there are \"no words\" to describe the tragedy.\n\n\"It's horrible,\" said Matt Mauser, holding back tears while talking about his wife Christina Mauser's death.",
  "Mother dog claws her way through rubble and stone to rescue her puppies after house collapse",
  "Twitter places public interest notice on this new tweet from President Trump.\n\n\"violates our policies regarding the glorification of violence based on the historical context of the last line, its connection to violence, and the risk it could inspire similar actions today\"",
  "At least two rhino poachers eaten by lions in South Africa \n\nhttps://ab.co/2KS66Pd",
  "EU deforestation law: Parliament wants to give companies one more year to comply.\n\nPress release: https://europa.eu/!vwvWMw",
  "Samantha Bee, who once interviewed former Mar-a-Lago staffers, has revealed one of Donald Trump's more unlikely fears.",
  "President Recep Tayyip Erdogan of Turkey, already looking unusually embattled amid an economic crisis and a surge in coronavirus cases, has  been hit by a roiling corruption scandal that some say has a  fin de siècle aura about it https://nyti.ms/3uYyjei",
  "Witnesses argue that the government knows more than it's admitting",
  "There's a Christmas comet on its way — and a meteor shower too https://ab.co/2QO1sbr",
  "Ukrainian president boycotted in Swiss parliament.\n\nThe largest party in the country’s legislature has walked out on an address by Vladimir Zelensky.\n\nRead more: https://on.rt.com/ce2i",
  "Press release summarising the hearing:",
  "BREAKING NEWS: The U.S. House of Representatives has voted to impeach President Donald Trump on two charges: abuse of power and obstruction of Congress.\n\nThe vote on the second charge (obstruction of Congress) was 229-198, and one member voting present.",
  "Democratic Rep. Josh Gottheimer of New Jersey says he will seek to become the Garden State's next governor, entering what is expected to be a crowded Democratic primary field.",
  "Asian American organizations say they are scrambling, but not surprised, over President-elect Trump’s potential mass deportations that could target undocumented immigrants from China first.",
  "Coalition 'keeping an open mind' on Kevin Rudd's US ambassador role after Trump election – video",
  "A huge cardboard skeleton sits in a street in the Tlahuac neighbourhood of Mexico City ahead of the Day of the Dead festival\n\n Pedro Pardo",
  "#BREAKING Notre-Dame's main structure is \"saved and preserved\" after fire, says Paris fire official",
  "Australians’ wages increase faster than inflation for fourth quarter running",
  "The Duke of Sussex announces his wife has given birth to a baby boy.\n\nFollow the latest on the #royalbaby here: http://po.st/VIpB02",
  "What does the ‘doge’ meme have to do with the US election?\n\nAdam Fleming educates Chris Mason on the latest #BBCNewscast\nhttps://bbc.co.uk/sounds/play/p0k4s94b…",
  "BREAKING NEWS -- REPORT: JOE BIDEN WILL DROP OUT OF PRESIDENTIAL RACE -- BREAKING NEWS",
  "Editor’s note: The tweet above ^ is from 2008, not tonight. This is being noted because this tweet is being tweeted by some users tonight as if it is new tonight. Again, the tweet above is from 2008, not 2020.",
  "#Wicked composer Stephen Schwartz: “Cynthia can sing anything, she’s gifted like a virtuoso with an instrument\" https://time.com/7175030/wicked-songs-stephen-schwartz-interview/…",
  "“It’s never just about ‘Baby or no baby?’” Merle Bombardieri says. “It’s about everything. It’s about acknowledging that you’re going to die someday, and what do you want to have happen in between?”",
  "Flags of various countries affected by the spread of #COVID19 are projected onto the statue of the Christ Redeemer atop Corcovado hill in Rio de Janeiro\n\n Florian Plancheur",
  "Israeli authorities detained Dr Adnan Al-Bursh in December 2023.  His family never saw him again.\n\nSky’s @sparkomat has spent months investigating the life and unexplained death of the much-loved Gazan surgeon.\n\nWhat happened? ",
  "TIME100 Climate: The most influential leaders driving business to real climate action https://ti.me/4hJ1JFU",
  "Germany is scrambling to save energy and reduce its dependence on Russian supplies. But one thing the country won’t do, apparently, is put a speed limit on its fabled autobahns.",
  "Medical examiner testifies that Jordan Neeley’s death was a direct result of the chokehold Daniel Penny held him in.",
  "Escambia Co. Sheriff's Office: \"There is no longer an active shooter on NAS Pensacola. The shooter is confirmed dead.\"",
  "Meta can ban us all it wants, but you can always find us here:\n\nX (Twitter): http://x.com/RT_com\nRumble: http://rumble.com/c/RTNews\nOdysee: http://odysee.com/@RT:fd\nVK: http://vk.com/rt_international…\nGab: http://gab.com/RT https://x.com/RT_com/status/1836387165174923385/video/1…",
  "BREAKING: House Speaker Mike Johnson says he will “strongly request” that the House Ethics Committee not release a report detailing its investigation into former Rep. Matt Gaetz.",
  "The Gaetz probe on his alleged misconduct may never see the light of day after a little nudge from Trump.",
  "Elon Musk handpicked by Trump to carry out slash-and-burn cuts plan",
  "The \"blood moon\" eclipse beside a statue of the ancient Greek goddess Hera in Athens",
  "Donald Trump is not yet president, but his plans already loom large over global summits",
  "President-elect Donald Trump has named ally and former Rep. Doug Collins, an Air Force Reserve chaplain, to run his Department of Veterans Affairs",
  "S. Korean boyband #BTS is estimated to contribute $3.63 billion annually to the S. Korean economy, the same as 26 mid-sized companies, a research institute said in a report on Tuesday. Some 800,000 tourists were believed to have visited South Korea last year because of the group.",
  "#Wicked composer Stephen Schwartz: \"It’s very exciting when you can tell a big story moment wordlessly, just with music and movement. That’s something Jon Chu was able to achieve in a wonderful way because of closeups, and things you don’t have onstage\" https://time.com/7175030/wicked-songs-stephen-schwartz-interview/…",
  "VIDEO:  A cyclist who was fired from her job after raising her middle finger to US President Trump's motorcade has been elected to local office in Virginia. #JuliBriskman, whose one-handed salute was captured in an AFP photo, beat the Republican incumbent in Loudoun County",
  "Tracking respiratory viruses in Canada: RSV, influenza, COVID-19",
  "Sara Sharif’s dad denies destroying phone evidence",
  "WATCH LIVE: Trump holds campaign rally at Madison Square Garden in New York",
  " LIVE: hearing with  Kaja Kallas, the proposed high representative for foreign affairs and security policy and vice-president of the European Commission",
  "WATCH LIVE: Bruce Springsteen joins Harris and Obama for campaign rally in Atlanta",
  "Texas Supreme Court clears way for new execution date for Robert Roberson, who was convicted of murder in 2002 shaken baby death",
  "Cabinet minister Randy Boissonnault apologizes over Indigenous identity claims",
  "Trump says he will leave the White House if Biden is confirmed by electoral college",
  "Passengers on parked Southwest plane forced to evacuate after cell phone, airplane seat catch fire",
  "Why the Guardian is no longer posting on X",
  "'Blame Mike' - absurdity and appeal of Tyson v Paul",
  "The editor-in-chief of 'Scientific American' has resigned following a string of expletive-laden posts on Election Night that slammed people voting for Donald Trump.",
  "Mike Pence has pleaded with Republican lawmakers to shoot down RFK Jr. as Trump’s HHS choice.",
  "Anne Hathaway was almost crashed into by New York Knicks player OG Anunoby at Wednesday's NBA matchup at Madison Square Garden. \n\nThe movie star called it a \"bucket-list moment.\"",
  "Cheryl Hines, once a vocal Democrat and anti-Trumper, is sticking by her man as he joins Donald Trump's administration.",
  " LIVE: hearing with  Stéphane Séjourné, the proposed executive vice-president for prosperity and industrial strategy",
  "‘Highly likely’ John Smyth continued to abuse young men in South Africa",
  "Our White House correspondent @Yamiche Alcindor has been named the recipient of the prestigious Aldo Beckman Award for Overall Excellence in White House Coverage by the @whca.",
  "By ordering civilians out of one third of Gaza, Israel has fed Palestinian fears and raised settlers' hopes",
  "What RFK Jr could do on US vaccines, fluoride and drugs",
  "Health stocks hit after Trump taps RFK Jr for top job",
  "A person from Yunnan Province died while on his way back to Shandong Province for work on a chartered bus on Monday. He was tested positive for #hantavirus. Other 32 people on bus were tested.",
  "hi",
  "Authorities in Canada uncovered the remains of 215 children, some as young as 3 years old, at the site of a former residential school for indigenous students https://reut.rs/3fuGZUs",
  "The daughters of Malcolm X sue the CIA, FBI and NYPD over the civil rights leader's assassination",
  "A migrant family, part of a caravan of thousands traveling from Central America to the U.S., run from tear gas in front of the border wall between the U.S. and Mexico at Tijuana on Sunday - @Reuters",
  "Former special forces soldier 'Canadian Dave' taken by the Taliban: sources",
  "Adani is paying millions to a Myanmar military-backed group, leaked documents show",
  "K-pop supergroup #BTS will perform during the semi-final episode of #BritainsGotTalent, reported British media Metro. It was reported that @SimonCowell “begged the S.Korean pop sensation to perform.”",
  "Former Solicitor General Ted Olson has died at 84. The conservative lawyer represented George W. Bush in the 2000 presidential election dispute and later successfully argued for same-sex marriage.",
  "Angry young voters gathered in Manila on Tuesday to protest Ferdinand Marcos Jr., the son and namesake of the former dictator, who clinched a landslide victory this week in one of the most divisive presidential elections in modern Philippine history.",
  "North Korean troops in Ukraine ‘grave escalation’, Scholz tells Putin",
  "Filmmaker Payal Kapadia on her Cannes award-winning drama and challenging the status quo in India through her work",
  "Vance's “second best day” of Donald Trump’s campaign was when his four-year-old son “told the media, they were all ‘fake news.’”",
  "The frozen remains of a 35,000-year-old saber-toothed cat have been studied for the first time in history, according to a study published in the journal Scientific Reports.",
  "Comedian Conan O'Brien to host 2025 Oscars",
  "Satirical news site The Onion has won the auction to acquire conspiracy theorist Alex Jones' Infowars",
  "Insurance bureau estimates $110 million in damages from October storms in B.C.",
  "A 1798 law was used to justify some internments during World War II. Trump says he’ll invoke it again for his mass deportation plan.",
  "#BREAKING: The WA Government has frozen all household fees and charges including electricity, water, public transport fares and motor vehicle charges.",
  "Trump's Pentagon pick was investigated for alleged sexual assault",
  "BREAKING: JOE BIDEN WILL BE PRESIDENT-ELECT, NBC NEWS PROJECTS. http://nbcnews.to/3eFgqK3",
  "People celebrate on Black Lives Matter plaza across from the White House in Washington, DC, after Joe Biden was projected as the winner of the 2020 U.S. presidential election.",
  "President Biden: \"We're going to rejoin the Paris Climate Accord as of today.\"",
  "Coronavirus: Monkeys 'escape with COVID-19 samples' after attacking lab assistant",
  "\"Enslavement reigned for 250 years on these shores. When it ended, this country could've extended its hallowed principles — life, liberty and the pursuit of happiness — to all, regardless of color,\" writer Ta-Nehisi Coates told Congress. \"But America had other principles in mind\"",
  "#UPDATE The first human trial to evaluate a candidate vaccine against the new coronavirus has begun in Seattle, US health officials said Monday, raising hopes in the global fight against the disease http://u.afp.com/35yV",
  "Moody's downgrades Mexican government's outlook to 'negative' over weakening of judiciary and debt",
  "President-elect Donald Trump has picked Robert F. Kennedy Jr. to be his next Department of Health and Human Services secretary. Kennedy, a prominent anti-vaccine conspiracy theorist, has accepted. https://cnn.it/4ev4aJq",
  "Plus, expert tips to keep in mind for set up, storage and more",
  "For the movie, #Wicked composer Stephen Schwartz considered an idea for a new song about Elphaba, Glinda, Fiyero, Boq, and Nessarose being friends.\n\n\"Like a Grease song, a 'We Go Together' type of thing,\" he says. But, ultimately, it didn't feel necessary",
  "From @madebyhistory: After the Civil War, Black voters faced danger and violence—and they fought for political power against all odds",
  "“#ARMY will grow with #BTS and we have many more 'six' anniversaries ahead of us,” wrote Chinese fans on Weibo as they launched a seven-day video display at Times Square in New York to celebrate #BTS6thAnniversary. http://globaltimes.cn/content/1154013.shtml… @BTS_twt @BTSW_official",
  "WATCH LIVE: Beyoncé joins Kamala Harris for campaign rally in Houston, Texas",
  "Where are the borders of the State of #Israel? – #Turkey’s #Erdogan to #UNGA",
  "Analysts and former Israeli national security officials tell TIME that the reality on the ground points to a prolonged Israeli military presence",
  "#BREAKING: For the first day since the pandemic’s peak in Australia, the country has recorded zero new locally acquired cases of coronavirus.",
  "‘No sign’ of promised fossil fuel transition as emissions hit new high",
  "Here's how you can see the last supermoon of 2024",
  "CNN got rare, exclusive access inside El Salvador's Cecot prison, where some of the country's most notorious gang members are held. David Culver tours the controversial high-security facility with prison officials, capturing firsthand accounts from inmates https://cnn.it/4exgFEz",
  "WATCH LIVE: Harris speaks at campaign rally with Michelle Obama in Kalamazoo, Michigan",
  "South Korean boyband @bts_bighit's brand new music video ‘Dynamite’ has broken the YouTube record for the most views in one day",
  "Parliament adopted its demands for the UN Climate Change Conference COP29, which aims to define a new collective goal for financing climate action.\n\nPress release:",
  "Georgia's Fulton County Jail subjects inmates to \"inhumane, violent\" conditions that threaten their safety, a Justice Department investigation finds",
  "Congratulations! #EXO member #Chen, 28, is confirmed to be preparing for his wedding. His bride is reportedly pregnant and not from the entertainment industry.",
  "Chinese netizens were stunned by the performance of #BTS at 2019MMA. The boy band swept grand prizes of the music award held on Saturday. http://bit.ly/2rImCfY",
  "VIDEO:  Fresh from his Oscars triumph for '#Parasite', which won best picture, film director Bong Joon-ho returns to South Korea from the US",
  "WATCH: The touching moment a London Underground train driver stopped his journey to salute people commemorating the anniversary of the Grenfell Tower fire https://trib.al/h94ZbFv",
  "Streeting’s hospital league table plan riles NHS medics and bosses",
  "Tropical Storm Sara has formed and is closing in on Central America where it is set to unleash disastrous flooding rain with \"life-threatening\" impact",
  "WATCH LIVE: Eminem introduces Obama at Harris campaign rally in Detroit",
  "Those convicted will now see ‘compulsory treatment of persons suffering from pedophilia’\n\nhttps://on.rt.com/ce7p",
  "A nine-year-old Kenyan boy who made a wooden hand-washing machine to help stop the spread of #COVID19 has been awarded a presidential award.\n\nRead today's top stories: https://news.sky.com",
  "X users jump to Bluesky - but what is it and who owns it?",
  "Republican presidential candidate Donald Trump is holding a campaign rally at Madison Square Garden, New York City, where he will be joined by a variety of famous guests.\n\n This livestream may include strong language viewers may find offensive\n\n",
  "MEPs demand more targeted EU sanctions against Russia’s so-called shadow fleet, which involves using old tankers to evade sanctions on crude oil and petroleum products\n\nPress release: https://europa.eu/!p7mTXj",
  "Breaking News: Former Prime Minister Imran Khan of Pakistan was wounded at a rally after at least one unidentified man opened fire on his convoy, in what aides have called a targeted attack.",
  "Jeff Beck was one of rock's greatest guitarists. Now his instruments are up for auction",
  "NEW: Which parts of Biden's legacy survive Trump and the Republican trifecta?\n\n Executive actions (easily undone)\n Dem spending/tax credits on clean energy & ACA (in danger)\n Bipartisan laws like CHIPS, infrastructure (likely safe)\n Judges (safe)\n\nhttps://nbcnews.com/politics/donald-trump/biden-laws-actions-trump-could-overturn-immigration-student-loans-rcna180151…",
  "K-pop stars SEVENTEEN, best known for hits such as ‘HOME;RUN’ and ‘Left & Right,’ drop their new EP ‘Your Choice’ and lead single ‘Ready to Love’ https://reut.rs/3gI1qhk",
  "Francia Márquez, una mujer de 40 años que trabajó como empleada doméstica, ahora es la principal contendiente a la vicepresidencia de Colombia.",
  "President Volodymyr Zelensky of Ukraine severed diplomatic ties with Russia as his country faced a wide-scale military attack.\n\nHe spoke as one of his advisers announced that more than 40 Ukrainian soldiers had died and dozens were wounded. \nhttps://nyti.ms/3IkmG85",
  "‘Very clearly gendered’: furious NSW nurses and midwives reject pay rise deal amid 24-hour strike",
  "Jair Bolsonaro has consistently claimed Brazil's electronic voting system is rife with fraud. Millions of his supporters have lost faith in their nation’s elections. Many claim they are prepared to take to the streets at his command. https://nyti.ms/3DXMzep",
  " LIVE: hearing with  Henna Virkkunen, the proposed executive vice-president for tech sovereignty, security and democracy",
  "Conan O'Brien will host the 97th Academy Awards, marking the Emmy-winning television host and comedian's first time at the helm of the Oscars",
  "Ferdinand Marcos Jr., the son and namesake of the ousted dictator, edged closer to a triumph in the presidential election in the Philippines on Monday as early vote counting put him in a commanding lead over Leni Robredo, his closest rival.",
  "K-pop sensation @bts_bighit scooped the 2020 Global Recording Artist of the Year Award from @IFPI_org https://reut.rs/30cDz0d",
  "Watch the clip from The Daily Beast Podcast here:",
  "For more than 30 years, plastic phones shaped like the cartoon cat Garfield have been washing up on French beaches.\n\nThe mystery is now solved: a shipping container which washed up during a storm in the 1980s was found in a hidden sea cave \n Fred Tanneau",
  "\"Broken glass\" special effects on a glass bridge along a cliff in North China's Hebei Province scare tourists",
  "'We shouldn't be bullied into believing people can be any sex they want to be, they can't. A man is a man and a woman is a woman', says Prime Minister Rishi Sunak.\n\nhttps://trib.al/YKanzN3\n Sky 501, Virgin 602, Freeview 233 and YouTube",
  "The lesson of campaign coverage, Richard Stengel writes, is to focus not on Trump, but what's going on around him",
  "\"Why only in America?\"\n\nUS Senator Ted Cruz walks away from @Stone_SkyNews after being asked if \"this is the moment to reform gun laws\" \n\nhttps://trib.al/nmOJAT8\n#TedCruz #America #Texasshooting #gunlaws",
  "President-elect Trump has tapped Todd Blanche, who represented him in several criminal cases, to be the No. 2 lawyer at the Department of Justice",
  "Chinese singer and #EXO member Zhang Yixing has been invited to attend the 61st #GRAMMYs Annul Awards due to his job as 2018 Promotion Ambassador for the Grammy festival in China.  #张艺兴 @weareoneEXO",
  "pwn3d. :)",
  "January 2020 was the hottest January in recorded history, NOAA says. \n\nEarth's 4 hottest Januaries have all occurred since 2016. http://nbcnews.to/2uHFvBD",
  "#Kashmiri conflict is waiting for solution for 72 years - #Erdogan to #UNGA",
  "Birdwatch: a close encounter with a flying rhino in Borneo",
  "Chinese scientists have developed a new weapon to combat the #coronavirus. They say they have found a nanomaterial that can absorb and deactivate the virus with 96.5-99.9% efficiency.",
  "Donald Trump has selected Matt Gaetz as his choice for attorney general.\n\nHear Lucy Fisher from the Financial Times discuss the controversial pick on the latest #BBCNewscast\nhttps://bbc.co.uk/sounds/play/p0k4s94b…",
  "RFK Jr.'s to-do list to make America 'healthy' has health experts worried",
  "Brazil protests escalate, disrupting fuel, grain and meat industries http://reut.rs/3NrL3UD",
  "English soccer game did not deliver such a big bounce for N.L. after all: province",
  "These guys are real heroes! | Old man rescued from burning building in #Paris",
  "Elon Musk has completed his $44 billion deal for Twitter. The company's CEO and CFO were terminated and escorted out of headquarters https://reut.rs/3ziMaA7",
  "K-pop boy band @TXT_bighit describe their latest EP as a teen account of how the lockdown shattered their world, and they hope it resonates with young people everywhere https://reut.rs/3luwUYc",
  "U.S. voting rights activist Stacey Abrams nominated for Nobel Peace Prize http://reut.rs/3pCjjAc"
]