[
    "Now available: Weekly data on the Assets and Liabilities of Commercial Banks in the United States #FedData https://federalreserve.gov/releases/h8/current/default.htm…",
    "See next week's #calendar of events:",
    "Our weekly #BalanceSheet update: https://federalreserve.gov/releases/h41/current/h41.htm… #FedData",
    "Interactive guide to our weekly #BalanceSheet report: https://federalreserve.gov/monetarypolicy/bst_fedsbalancesheet.htm… #FedData",
    "#FedFAQ: What is the FOMC and when does it meet?\n\nThe Federal Open Market Committee (FOMC) is the monetary policymaking body of the Federal Reserve System.\n\nLearn more: https://federalreserve.gov/faqs/about_12844.htm…",
    "#EconEdMonth is ending, but resources are available year-round! Teachers have access to free, classroom-ready, online materials for students from kindergarten to college.\n\nLearn more: https://federalreserve.gov/aboutthefed/educational-tools/economic-education-month.htm…",
    "The Federal Reserve is the central bank of the United States. It performs five key functions that serve all Americans and promote the health and stability of the U.S. economy and financial system.\n\nTo learn more about who we are, visit:\nhttps://federalreserve.gov/aboutthefed/fedexplained/who-we-are.htm…",
    "#ICYMI: Earlier this month at Exploring Careers in #Economics, Governor Kugler and research assistants discussed career paths in economics with high school and college students. #FedEconJobs   \n \nView the video here: https://federalreserve.gov/conferences/exploring-careers-in-economics-fall-2024.htm…",
    "The Federal Reserve System performs five key functions that serve all Americans and promote the health and stability of the U.S. economy and financial system.\n\nThis week we’re highlighting how we supervise and regulate financial institutions.\n\nhttps://federalreserve.gov/aboutthefed/fedexplained/supervision-regulation.htm…",
    "Do you want to learn more about the Federal Reserve? Check out the interactive Federal Reserve Explained at https://federalreserve.gov/aboutthefed/fedexplained/who-we-are.htm…",
    "Interactive guide to our weekly #BalanceSheet report: https://federalreserve.gov/monetarypolicy/bst_fedsbalancesheet.htm… #FedData",
    "Our weekly #BalanceSheet update: https://federalreserve.gov/releases/h41/current/h41.htm… #FedData",
    "Today’s #EnforcementActions:",
    "Read about economic conditions in Reserve Bank Districts in the #BeigeBook: https://federalreserve.gov/monetarypolicy/publications/beige-book-default.htm… (1/2)",
    "The 12 Reserve Banks represent different geographic regions, or districts, and provide a wealth of information on conditions across the nation.\n\nLearn more about the Reserve Banks’ role as a key entity of the Federal Reserve System (2/2):",
    "Opening remarks by Governor Bowman @philadelphiafed: https://federalreserve.gov/newsevents/speech/bowman20241023a.htm…\n\nWatch live: https://teams.microsoft.com/l/meetup-join/19%3ameeting_MzVhZGU5OWEtZDViYy00ZDZhLTliOWMtYjJhYjRiOWJmMzYz%40thread.v2/0?context=%7b%22Tid%22%3a%22b397c653-5b19-463f-b9fc-af658ded9128%22%2c%22Oid%22%3a%22f37e091c-4266-439e-b1fc-d2b71a14271f%22%7d…",
    "Learn more about Governor Bowman:",
    "The Federal Reserve System performs five key functions that serve all Americans and promote the health and stability of the U.S. economy and financial system.\n\nThis week we’re highlighting how we promote consumer protection and community development.\nhttps://federalreserve.gov/aboutthefed/fedexplained/consumers-communities.htm…",
    "You want to start a conversation with an old colleague or manager, but you haven’t talked in years. Here’s how to parachute into a long-lost acquaintance’s inbox.",
    "Donald Trump’s argument has changed little over three campaigns. Now, an election is poised to settle a central question—whether a discontented country will endorse or reject his destabilizing vision.",
    "Breaking: Quincy Jones, the legendary record producer who worked with stars from Frank Sinatra to Michael Jackson, has died. He was 91.",
    "Here is an early look at the front page of The Wall Street Journal https://on.wsj.com/3NVoskB",
    "Hopes that China is awaiting the results of the U.S. election to unveil a huge stimulus package are unikely to be fulfilled, though a smaller package is expected soon",
    "Ukraine’s tech-savvy drone pilots target Russian tanks and infantry with their inexpensive devices, holding back their advance",
    "As Donald Trump and Kamala Harris ping-pong around the nation in the last days of the campaigns, they share something in common: the need for caffeine, snacks and fast food",
    "A 74-year-old is in a race against time to find someone willing to take his collection of 4.2 million butterflies",
    "Some investors just want this election to be over, analysts say, no matter who wins",
    "Here’s a look at pivotal races that could decide which party wins control of the House",
    "Wearable, portable breast pumps can help new moms reclaim some of their freedom—and continue providing breast milk when they return to work",
    "Shawn and Leanne Till compete in rally competitions in Italy and the U.S. in their unrestored 1931 Alfa Romeo 6C 1750 Gran Sport Spider Zagato",
    "Seniors who have suffered severe cognitive decline and were unaware of it saw their wealth decrease by about $31,000 on average, researchers find",
    "Classical columns are a blast from the past, but some designers say when done right, they are far from ancient history",
    "Why people in their 40s are getting their knees and hips replaced",
    "Why is this minimalist, retro sneaker everywhere now?",
    "Have we ruined sex? Five writers ask whether society has lost its way when it comes to the most intimate of human acts. https://on.wsj.com/40vC9hJ",
    "Bankrupt just a decade ago, it's now America's most unlikely boomtown"
]