[
    "NEW\n\nFrom the New York Times editorial board: “As a dedicated public servant who has demonstrated care, competence and an unwavering commitment to the Constitution, Kamala Harris stands alone in this race.”",
    "Americans may think no one is handling the coronavirus worse than President Trump. But @felipeneto says President Jair Bolsonaro of Brazil is much, much worse. https://nyti.ms/2OqvO0D",
    "“Seriously I can just come out and say it? Call him a liar?” asks @JonathanPieNews, a fictional broadcast reporter created and performed by comedian Tom Walker, in a satirical video about Britain’s Prime Minister.\n“God bless America.” https://nyti.ms/3306M3q",
    "A shift manager at a McDonald’s restaurant in Kansas City, Mo., asks why a company that earned $5.3 billion last year can’t guarantee paid sick leave for all of its workers. https://nyti.ms/2U2gP0m",
    "Donald Trump “stands without any real rivals as the worst American president in modern history,” writes the editorial board. Today, we are publishing a special section to remind readers why President Trump is unfit to lead the nation. https://nyti.ms/37dIhiS",
    "On Sunday, Brazilians go to the polls to elect their next president. But at stake is something far more important than the leadership of the largest economy in South America.",
    "NEW: The New York Times editorial board endorses @JoeBiden for president: ”His campaign is rooted in steadiness, experience, compassion and decency\"",
    "\"I knew, as I clutched my firstborn child, that I was losing my second,” Meghan Markle writes about her miscarriage. Today, we are sharing an essay by the Duchess of Sussex about the loss that she and Prince Harry suffered earlier this year.",
    "Liz Truss will be Britain’s next prime minister — the nation’s fourth in seven years. And she’s inheriting a nation falling apart at the seams. https://nyti.ms/3ASl6ru",
    "\"Americans like to boast about being the world leader at everything,” says @felipeneto, a Brazilian YouTuber. “But I'm certain that our leader, Jair Bolsonaro, is the worst Covid president in the world.\" https://nyti.ms/2OqvO0D",
    "The survivors and family members of mass shootings have a message for the leaders of our nation.",
    "Donald Trump stands without any real rivals as the worst American president in modern history. He is a man unworthy of the office he holds, writes the editorial board. https://nyti.ms/356M8M8",
    "What are Mexicans doing in America?\n\nWinning.",
    "New from Jimmy Carter: “I now fear that what we have fought so hard to achieve globally — the right to free, fair elections, unhindered by strongman politicians who seek nothing more than to grow their own power — has become dangerously fragile at home.”",
    "Happy Birthday, Facebook! 15 years today — and what a rollercoaster it has been. We created a friendship anniversary video for Mark Zuckerberg to mark the day.",
    "“I want you to know that in the last days and hours of my life you inspired me,” wrote Representative John Lewis, who penned this essay shortly before his death on July 17. We are publishing it today, on the day of his funeral.",
    "\"Israel has the absolute right to live in peace and security, but so do the Palestinians. I strongly believe that the United States has a major role to play in helping Israelis and Palestinians to build that future,” writes @BernieSanders."
]