[
    "Boeing's unionized workers have voted to reject a deal from the aircraft manufacturer, prolonging a six-week strike",
    "After labeling Donald Trump a fascist, Kamala Harris addressed key priorities including immigration and abortion access while vowing to work with Republicans.\n\nFollow live updates on the CNN town hall. https://cnn.it/40jjbdU",
    "Vice President Kamala Harris called Donald Trump a fascist and \"increasingly unstable,\" citing former Trump officials who have come out against the former president.\n\nFollow live updates.",
    "Vice President Kamala Harris joins Anderson Cooper to face questions from undecided and persuadable Pennsylvania voters.\n\nFollow live, watch on CNN and stream on Max.",
    "The conflict in Sudan has been drastically overshadowed by the wars in Ukraine and Gaza, but the UN fears it could become far deadlier",
    "Dozens of infections and at least one death have been reported as an E. coli outbreak linked to McDonald's Quarter Pounders is expected to grow",
    "Justice Department warns Elon Musk’s America PAC that his $1 million sweepstakes for registered voters in swing states may be illegal, sources say.",
    "Vice President Harris said comments by Donald Trump’s former chief of staff about the former president invoking Adolf Hitler were “deeply troubling.”",
    "Secretary of Defense Lloyd Austin says North Korea has deployed troops to Russia, the first US official to publicly confirm the development",
    "The Georgia Supreme Court has upheld a block on controversial election rules passed by allies of Trump, a major victory for Democrats in the battleground state",
    "The CDC has issued a warning about a deadly multistate E. coli outbreak that it says is linked to McDonald's Quarter Pounders",
    "Denny's, a diner chain best known for never closing its doors, will shut down a tenth of its locations as it mulls a big change to its 24/7 operating hours",
    "Rudy Giuliani must turn over control of his Manhattan penthouse apartment and luxury items to Georgia election workers whom he defamed, a judge has ruled",
    "A CNN investigation reveals how deceptive political fundraisers have misled hundreds of elderly Americans into giving away millions of dollars",
    "Federal appeals court upholds conviction of \"Cowboys for Trump\" founder in a case that may impact similar prosecutions of January 6 rioters",
    "Mike Jeffries, former CEO of Abercrombie & Fitch, has been arrested on charges related to sex trafficking, sources tell CNN",
    "Political reporter Olivia Nuzzi is out at New York magazine after undisclosed relationship with Robert F. Kennedy Jr.",
    "Lighting on a Houston radio tower reportedly failed days before a helicopter slammed into it on Sunday, killing four people",
    "\"Central Park Five\" sue Trump over false and defamatory statements they allege he made about their 1989 case during last month's presidential debate",
    "Infants died at higher rates in the US following the Supreme Court decision that revoked the federal right to an abortion, new research finds",
    "Pfizer and BioNTech say their COVID-19 vaccine is more than 90% effective https://reut.rs/3eDWrvv",
    "South Korea's soccer player Son Heung-min returned home to a rousing welcome after the Tottenham Hotspur forward ended the season as the Premier League's joint top scorer with Mohamed Salah",
    "K-pop boy band @TXT_bighit describe their latest EP as a teen account of how the lockdown shattered their world, and they hope it resonates with young people everywhere https://reut.rs/3luwUYc",
    "K-pop sensation @bts_bighit scooped the 2020 Global Recording Artist of the Year Award from @IFPI_org https://reut.rs/30cDz0d",
    "Elon Musk has completed his $44 billion deal for Twitter. The company's CEO and CFO were terminated and escorted out of headquarters https://reut.rs/3ziMaA7",
    "U.S. voting rights activist Stacey Abrams nominated for Nobel Peace Prize http://reut.rs/3pCjjAc",
    "K-pop stars SEVENTEEN, best known for hits such as ‘HOME;RUN’ and ‘Left & Right,’ drop their new EP ‘Your Choice’ and lead single ‘Ready to Love’ https://reut.rs/3gI1qhk",
    "Brazil protests escalate, disrupting fuel, grain and meat industries http://reut.rs/3NrL3UD",
    ".@AOC nominates Senator Bernie Sanders for president of the United States 'out of the love for all people' https://reut.rs/3g6aHfk",
    "Authorities in Canada uncovered the remains of 215 children, some as young as 3 years old, at the site of a former residential school for indigenous students https://reut.rs/3fuGZUs",
    "South Korean boyband @bts_bighit's brand new music video ‘Dynamite’ has broken the YouTube record for the most views in one day",
    "Following a record-breaking 2019, K-Pop band @BTS_twt reached new heights with their first English-language song ‘Dynamite’ on the U.S. Billboard charts. But they wish they could celebrate with their fans https://reut.rs/2RpeCtL",
    "'I feel gay', FIFA chief attempts to empathise with marginalised http://reut.rs/3TYOynu",
    "Ukrainian refugees fleeing the Russian invasion arrived in Madrid with the help of a group of Spanish taxi drivers who volunteered for a 40-hour trip to Poland and back to support the mass evacuation https://reut.rs/361tcTx",
    "Inventor Richard Browning flies in his jet suit as it goes on sale in London, proving anyone can be a real-life Iron Man - for £340,000",
    "Exclusive: Tesla is considering exporting China-made electric cars to the U.S., a reversal that would reflect the automaker's deepening cost advantage at its Shanghai plant and slower demand from Chinese consumers https://reut.rs/3DZSJJB",
    "Madame Tussauds in Berlin loaded its wax effigy of Donald Trump into a dumpster, calling it a 'preparatory measure' ahead of the election https://reut.rs/35NKJuf",
    "U.S. Office of Special Counsel has opened an investigation into the Trump campaign's use of the White House for campaign-related activities to see if federal law has been violated. More #Election2020 updates: https://reut.rs/3p4aIWQ"
]