[
    {
        "source": "X.com",
        "url": "https://x.com/CNN",
        "tweets": [
            {
                "text": "Tropical Storm Milton has formed in the Gulf of Mexico. It's expected to strengthen and hit Florida next week.",
                "timestamp": "2024-10-05T18:17:03.000Z"
            },
            {
                "text": "Hezbollah has lost contact with a possible successor to assassinated leader Hassan Nasrallah. Hashem Safieddine was targeted in an Israeli airstrike.\n\nFollow live updates.",
                "timestamp": "2024-10-05T12:50:50.000Z"
            },
            {
                "text": "Israel has given no assurances it won't target Iran's nuclear facilities, a top State Department official tells CNN",
                "timestamp": "2024-10-04T21:47:13.000Z"
            },
            {
                "text": "Factory workers in Tennessee were carried away by floodwaters. Their families say they weren't allowed to leave work in time to flee.",
                "timestamp": "2024-10-04T21:01:46.000Z"
            },
            {
                "text": "JUST IN: The Dow closed at a record high after a strong jobs report raised optimism on Wall Street that the economy will achieve a soft landing",
                "timestamp": "2024-10-04T20:21:49.000Z"
            },
            {
                "text": "Before-and-after aerial photos show Helene wiped parts of North Carolina off the map, as rivers rage where buildings once stood",
                "timestamp": "2024-10-04T17:57:01.000Z"
            },
            {
                "text": "A Supreme Court ruling allows the Biden administration to enforce rules that would cut emissions of planet-warming methane gas and mercury",
                "timestamp": "2024-10-04T17:00:12.000Z"
            },
            {
                "text": "The US economy added a whopping 254,000 jobs last month, providing further reassurance of ongoing stability for the labor market.\n\nFollow live updates:",
                "timestamp": "2024-10-04T12:41:06.000Z"
            },
            {
                "text": "Negotiators reach a tentative deal on wages in the port strike, with union members returning to work Friday, sources say",
                "timestamp": "2024-10-03T22:36:45.000Z"
            },
            {
                "text": "Country star Garth Brooks has been accused of sexual assault and battery in a lawsuit from a hair and makeup artist. He previously denied the claims.",
                "timestamp": "2024-10-03T20:23:46.000Z"
            },
            {
                "text": "An anonymous celebrity is asking a court to stop a sexual assault accuser from going public with her allegations before she files a lawsuit naming him",
                "timestamp": "2024-10-03T17:35:29.000Z"
            },
            {
                "text": "Death toll from Hurricane Helene soars to 200 after officials in Georgia and Florida report additional deaths",
                "timestamp": "2024-10-03T15:25:11.000Z"
            },
            {
                "text": "Melania Trump confirms her support for abortion rights and a woman's \"individual freedom,\" a stance that puts her at odds with her husband",
                "timestamp": "2024-10-03T13:05:51.000Z"
            },
            {
                "text": "A court has ruled that a couple that was in a severe crash during an Uber ride can’t sue the company because they and their daughter agreed to arbitration when they accepted the terms of service for a separate Uber Eats order",
                "timestamp": "2024-10-02T23:45:41.000Z"
            },
            {
                "text": "The CDC forecasts this respiratory disease season could be worse than pre-pandemic years but vaccination rates may lower the burden of infections",
                "timestamp": "2024-10-02T21:37:49.000Z"
            },
            {
                "text": "Mark Chavez, one of the two doctors charged in connection with “Friends” star Matthew Perry’s death, has pleaded guilty to one count of conspiracy to distribute ketamine as part of a plea agreement",
                "timestamp": "2024-10-02T20:52:10.000Z"
            },
            {
                "text": "A new filing provides the fullest picture yet of the 2020 election case, outlining what special counsel Jack Smith describes as Donald Trump's \"private criminal conduct\"",
                "timestamp": "2024-10-02T20:11:01.000Z"
            },
            {
                "text": "Bank of America customers reported a widespread outage, with many people unable to access their accounts and others seeing zero balances",
                "timestamp": "2024-10-02T19:03:40.000Z"
            },
            {
                "text": "Biden says he does not support a retaliatory strike by Israel on Iranian nuclear sites following Tehran's missile attack.\n\nFollow live updates.",
                "timestamp": "2024-10-02T17:41:22.000Z"
            },
            {
                "text": "People are buying up toilet paper because of the port strike in a bit of pandemic déjà vu, but there's no need for that",
                "timestamp": "2024-10-02T16:32:43.000Z"
            }
        ]
    },
    {
        "source": "X.com",
        "url": "https://x.com/TIME",
        "tweets": [
            {
                "text": "TIME100 Next: Sabrina Carpenter https:// ti.me/3ZI5fKh",
                "timestamp": "2024-10-02T11:50:18.000Z"
            },
            {
                "text": "Here's what you need to know about Tropical Storm Milton's expected path.\n\n\"Risk of life-threatening impacts increasing for portions of the Florida west coast.\"",
                "timestamp": "2024-10-06T16:01:00.000Z"
            },
            {
                "text": "Elon Musk makes animated first appearance at a Trump rally and casts election in dire terms",
                "timestamp": "2024-10-06T15:10:00.000Z"
            },
            {
                "text": "The latest on Hurricane Leslie and where it's heading",
                "timestamp": "2024-10-06T14:01:00.000Z"
            },
            {
                "text": "Here's what we know about Taylor Swift's net worth as she reaches a major new milestone",
                "timestamp": "2024-10-06T13:17:55.000Z"
            },
            {
                "text": "Donald Trump returned on Saturday to the Pennsylvania fairgrounds where he was nearly assassinated in July.\n\nHere's what to know",
                "timestamp": "2024-10-06T11:01:00.000Z"
            },
            {
                "text": "Thousands join pro-Palestinian rallies around the globe as Oct. 7 anniversary nears",
                "timestamp": "2024-10-05T22:30:01.000Z"
            },
            {
                "text": "Column: The myth of Hezbollah has been shattered",
                "timestamp": "2024-10-05T20:30:00.000Z"
            },
            {
                "text": ". @oliviarodrigo on @laufey : \"Laufey makes jazz and classical music feel accessible to our generation. Her music is a place where everyone is welcome, and it's never pretentious\"",
                "timestamp": "2024-10-05T20:03:00.000Z"
            },
            {
                "text": "Marjorie Taylor Greene sparks backlash with comments made amid the devastation of Hurricane Helene",
                "timestamp": "2024-10-05T18:01:00.000Z"
            },
            {
                "text": "Tesla is recalling more than 27,000 vehicles. Here's why",
                "timestamp": "2024-10-05T17:11:00.000Z"
            },
            {
                "text": "What to know about Hurricane Leslie and where it's heading",
                "timestamp": "2024-10-05T16:01:01.000Z"
            },
            {
                "text": "FEMA has faced criticism and praise during Hurricane Helene. Here's what it does — and doesn't do",
                "timestamp": "2024-10-05T15:02:09.000Z"
            },
            {
                "text": "Trump plans to return Saturday to the site where a gunman tried to assassinate him in July",
                "timestamp": "2024-10-05T12:31:57.000Z"
            },
            {
                "text": "\"Kirk remains a powerful major hurricane over the open Atlantic.\"\n\nHere's what you need to know about Hurricane Kirk and where it's heading",
                "timestamp": "2024-10-05T12:17:47.000Z"
            },
            {
                "text": "When is the deadline to register to vote? How do you vote early? What's the difference between absentee voting and vote-by-mail?\n\nHere's everything you need to know about voting in the 2024 election: https:// time.com/7024848/how-to -vote-2024-election/ …",
                "timestamp": "2024-10-05T11:03:01.000Z"
            },
            {
                "text": "TIME CO2 Leadership Report: As the number of billion-dollar disasters rise, the economic toll will be increasingly difficult to absorb @JustinWorland",
                "timestamp": "2024-10-04T18:03:00.000Z"
            },
            {
                "text": "\"Kingsley Ben-Adir exudes a true love for humanity,\" writes Da'Vine Joy Randolph",
                "timestamp": "2024-10-04T17:10:00.000Z"
            },
            {
                "text": "Saoirse Ronan gives a marvelously nuanced performance in \"The Outrun\"",
                "timestamp": "2024-10-04T17:03:00.000Z"
            }
        ]
    },
    {
        "source": "X.com",
        "url": "https://x.com/elonmusk",
        "tweets": [
            {
                "text": "Live from the @realDonaldTrump rally in Pennsylvania. \n\nSame location where he was shot.",
                "timestamp": "2024-10-05T20:32:51.000Z"
            },
            {
                "text": "Next I’m buying Coca-Cola to put the cocaine back in",
                "timestamp": "2022-04-28T00:56:58.000Z"
            },
            {
                "text": "No Text Found",
                "timestamp": "2024-07-13T22:51:28.000Z"
            },
            {
                "text": "I hope that even my worst critics remain on Twitter, because that is what free speech means",
                "timestamp": "2022-04-25T16:12:30.000Z"
            },
            {
                "text": "Let’s make Twitter maximum fun!",
                "timestamp": "2022-04-28T01:53:50.000Z"
            },
            {
                "text": "Yesss!!!",
                "timestamp": "2022-04-25T19:43:22.000Z"
            },
            {
                "text": "Listen, I can’t do miracles ok",
                "timestamp": "2022-04-28T01:57:27.000Z"
            },
            {
                "text": "I fully endorse President Trump and hope for his rapid recovery",
                "timestamp": "2024-07-13T22:45:13.000Z"
            },
            {
                "text": "the bird is freed",
                "timestamp": "2022-10-28T03:49:11.000Z"
            },
            {
                "text": "Comedy is now legal on Twitter",
                "timestamp": "2022-10-28T21:16:42.000Z"
            },
            {
                "text": "Haters will say this is AI",
                "timestamp": "2024-08-14T15:24:30.000Z"
            },
            {
                "text": "Good",
                "timestamp": "2024-08-01T17:48:24.000Z"
            },
            {
                "text": "Absolutely",
                "timestamp": "2024-08-01T12:27:35.000Z"
            },
            {
                "text": "If I die under mysterious circumstances, it’s been nice knowin ya",
                "timestamp": "2022-05-09T00:51:26.000Z"
            },
            {
                "text": "The extreme antibody reaction from those who fear free speech says it all",
                "timestamp": "2022-04-26T18:26:46.000Z"
            },
            {
                "text": "Oh hi lol",
                "timestamp": "2023-06-18T01:00:25.000Z"
            },
            {
                "text": "If you’re reading this post, it’s because our servers are working",
                "timestamp": "2024-03-05T16:12:28.000Z"
            }
        ]
    },
    {
        "source": "X.com",
        "url": "https://x.com/BarackObama",
        "tweets": [
            {
                "text": "Michelle and I are thinking of everyone impacted by Hurricane Helene, and are grateful to the first responders and volunteers doing everything they can to help. Here are some ways to support folks in need: http:// obama.org/stories/take-a ction-hurricane-helene …",
                "timestamp": "2024-09-28T00:40:16.000Z"
            },
            {
                "text": "\"No one is born hating another person because of the color of his skin or his background or his religion...\"",
                "timestamp": "2017-08-13T00:06:09.000Z"
            },
            {
                "text": "Kobe was a legend on the court and just getting started in what would have been just as meaningful a second act. To lose Gianna is even more heartbreaking to us as parents. Michelle and I send love and prayers to Vanessa and the entire Bryant family on an unthinkable day.",
                "timestamp": "2020-01-26T21:56:16.000Z"
            },
            {
                "text": "Congratulations to my friend, President @JoeBiden ! This is your time.",
                "timestamp": "2021-01-20T14:45:13.000Z"
            },
            {
                "text": "In every scene, you are my star, @MichelleObama ! Happy birthday, baby!",
                "timestamp": "2020-01-17T14:13:19.000Z"
            },
            {
                "text": "Happy birthday to my love, my partner, and my best friend. Every moment with you is a blessing. Love you, Miche.",
                "timestamp": "2021-01-17T14:00:40.000Z"
            },
            {
                "text": "John McCain is an American hero & one of the bravest fighters I've ever known. Cancer doesn't know what it's up against. Give it hell, John.",
                "timestamp": "2017-07-20T00:49:02.000Z"
            },
            {
                "text": "My statement on the death of George Floyd:",
                "timestamp": "2020-05-29T16:06:54.000Z"
            },
            {
                "text": "Like the Beatles said: It’s getting better all the time. Thanks, babe, for 27 amazing years!",
                "timestamp": "2019-10-03T14:10:50.000Z"
            },
            {
                "text": "ME:  Joe, about halfway through the speech, I’m gonna wish you a happy birth--\nBIDEN:  IT’S MY BIRTHDAY!\nME:  Joe.\n \nHappy birthday to @JoeBiden , my brother and the best vice president anybody could have.",
                "timestamp": "2017-11-20T19:02:11.000Z"
            },
            {
                "text": "Vote.",
                "timestamp": "2020-05-14T18:44:56.000Z"
            },
            {
                "text": "Hi everybody! Back to the original handle. Is this thing still on? Michelle and I are off on a quick vacation, then we’ll get back to work.",
                "timestamp": "2017-01-20T21:04:08.000Z"
            },
            {
                "text": "Michelle & I are praying for the victims in Las Vegas. Our thoughts are with their families & everyone enduring another senseless tragedy.",
                "timestamp": "2017-10-02T12:41:16.000Z"
            },
            {
                "text": "Young people have helped lead all our great movements. How inspiring to see it again in so many smart, fearless students standing up for their right to be safe; marching and organizing to remake the world as it should be. We've been waiting for you. And we've got your backs.",
                "timestamp": "2018-02-22T16:00:44.000Z"
            },
            {
                "text": "Congratulations to my friends, @JoeBiden and @KamalaHarris — our next President and Vice President of the United States.",
                "timestamp": "2020-11-07T18:03:22.000Z"
            },
            {
                "text": "Michelle and I are thinking of the victims and their families in Barcelona. Americans will always stand with our Spanish friends. Un abrazo.",
                "timestamp": "2017-08-17T19:15:11.000Z"
            },
            {
                "text": "\"People must learn to hate, and if they can learn to hate, they can be taught to love...\"",
                "timestamp": "2017-08-13T00:06:27.000Z"
            },
            {
                "text": "Michelle and I are so inspired by all the young people who made today’s marches happen. Keep at it. You’re leading us forward. Nothing can stand in the way of millions of voices calling for change.",
                "timestamp": "2018-03-24T17:07:47.000Z"
            },
            {
                "text": "Happy Valentine’s Day, @MichelleObama . You make every day and every place better.",
                "timestamp": "2018-02-14T16:25:03.000Z"
            },
            {
                "text": "Happy anniversary, sweetheart! @MichelleObama , you're brilliant, kind, funny, and beautiful—and I'm lucky to call you mine.",
                "timestamp": "2023-10-03T14:33:47.000Z"
            },
            {
                "text": "Thinking about our neighbors in Mexico and all our Mexican-American friends tonight. Cuidense mucho y un fuerte abrazo para todos.",
                "timestamp": "2017-09-20T02:30:52.000Z"
            },
            {
                "text": "On behalf of the Obama family, Merry Christmas! We wish you joy and peace this holiday season.",
                "timestamp": "2017-12-25T16:05:05.000Z"
            },
            {
                "text": "I knew it way back then and I’m absolutely convinced of it today — you’re one of a kind, @MichelleObama . Happy Birthday!",
                "timestamp": "2019-01-17T15:02:10.000Z"
            }
        ]
    },
    {
        "source": "X.com",
        "url": "https://x.com/justinbieber",
        "tweets": [
            {
                "text": "Happy bday #JUNGKOOK . They ain’t ready :) now watch this tweet go crazy",
                "timestamp": "2019-08-31T22:33:10.000Z"
            },
            {
                "text": "I want my friend out.. I appreciate you trying to help him. But while your at it @realDonaldTrump can you also let those kids out of cages?",
                "timestamp": "2019-07-20T04:15:44.000Z"
            },
            {
                "text": "Never say never",
                "timestamp": "2021-02-11T18:25:56.000Z"
            },
            {
                "text": "No Text Found",
                "timestamp": "2018-01-07T09:06:30.000Z"
            },
            {
                "text": "#PrayforManchester",
                "timestamp": "2017-05-23T05:17:30.000Z"
            },
            {
                "text": "Happy new year",
                "timestamp": "2019-01-01T20:09:26.000Z"
            },
            {
                "text": "Wait a minute that’s my gurl",
                "timestamp": "2018-12-18T20:03:24.000Z"
            },
            {
                "text": "Thank you next is a bop. My favorite song. Least this song is smash. Fire",
                "timestamp": "2018-11-08T16:43:52.000Z"
            },
            {
                "text": "It's my birthday and all I want is to be a better friend, better brother, better son and better man",
                "timestamp": "2017-03-02T03:08:54.000Z"
            },
            {
                "text": "Praying for all those in pain",
                "timestamp": "2017-10-02T17:00:17.000Z"
            },
            {
                "text": "My I love you face",
                "timestamp": "2017-01-16T20:00:48.000Z"
            },
            {
                "text": "#24",
                "timestamp": "2018-03-02T04:04:27.000Z"
            },
            {
                "text": "Can we still be friends",
                "timestamp": "2017-08-13T22:15:10.000Z"
            },
            {
                "text": "Everyone have an amazing week",
                "timestamp": "2017-11-20T18:51:46.000Z"
            },
            {
                "text": "Thank you. #25",
                "timestamp": "2019-03-02T05:40:40.000Z"
            },
            {
                "text": "Watched never say never on Netflix. Great movie",
                "timestamp": "2017-01-08T06:28:11.000Z"
            },
            {
                "text": "Have an amazing Christmas",
                "timestamp": "2018-12-24T22:00:12.000Z"
            },
            {
                "text": "YOU ARE ALL WORTHY NO MATTER WHAT ANYONE SAYS >> BE STRONG GOD IS WITH US ALL> MY BELIEBERS CHANGED MY LIFE> I WILL FOREVER BE GRATEFUL",
                "timestamp": "2014-01-24T23:32:06.000Z"
            },
            {
                "text": "Despacito #1 in the world. Thank you",
                "timestamp": "2017-04-24T20:25:00.000Z"
            },
            {
                "text": "Meet the newest Bieber, my baby sister Bay Bieber",
                "timestamp": "2018-08-17T21:53:39.000Z"
            },
            {
                "text": "Proud of you @billieeilish",
                "timestamp": "2019-04-14T08:18:12.000Z"
            },
            {
                "text": "Amazing show @ArianaGrande . Super proud of you. Had a moment mid show :) @billieeilish",
                "timestamp": "2019-04-15T19:00:27.000Z"
            },
            {
                "text": "My guys from @BTS_twt out here killing it. Congrats fellas.",
                "timestamp": "2020-02-23T04:05:17.000Z"
            },
            {
                "text": "3 years ago today released #Purpose . Thank you",
                "timestamp": "2018-11-13T23:08:06.000Z"
            },
            {
                "text": "Praying for everyone down in Houston",
                "timestamp": "2017-08-30T13:58:03.000Z"
            },
            {
                "text": "Praying for Las Vegas",
                "timestamp": "2017-10-02T16:59:43.000Z"
            },
            {
                "text": "Thank you @ArianaGrande . Thank you @coachella . That felt right. Love you.",
                "timestamp": "2019-04-22T08:42:21.000Z"
            },
            {
                "text": "Love you",
                "timestamp": "2019-05-24T08:25:08.000Z"
            },
            {
                "text": "Making new music",
                "timestamp": "2019-05-30T17:51:02.000Z"
            },
            {
                "text": "Merry Christmas!",
                "timestamp": "2019-12-25T20:57:39.000Z"
            },
            {
                "text": "Your boy",
                "timestamp": "2021-02-25T21:41:59.000Z"
            }
        ]
    }
]